{
  "schema_version": "1.0",
  "days": {
    "friday": [
      {
        "index": 1,
        "arabic": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُور",
        "translations": {
          "en": "O Allah, make us among those who remember You",
          "ur": "اے میرے رب! میری مغفرت فرما اور میری توبہ قبول فرما، بے شک توبڑا ہی توبہ قبول کرنے والا اور نہایت معاف کرنے والا ہے۔ "
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 2,
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْت",
        "translations": {
          "en": "O Allah, make us among those who remember You",
          "ur": "اے اللہ تو ہی میرا رب ہے۔ تیرے سوا کوئی عبادت کے لائق نہیں، تو ہی میرا خالق اور میں تیرا ہی بندہ ، عہد کرتا ہوں کہ جتنا ہوسکے گا تجھ سے کیے گئے (بندگی وفرماں برداری کے)وعدے پر قائم رہوں گا۔ میں اپنے برے اعمال کے شر سے تیری پناہ چاہتا ہوں۔ اپنے اوپرتیرے احسانات کا اعتراف کرتا ہوں اور اپنے گناہوں کااقرار کرتا ہوں۔ پس تو میری مغفرت فرمادے، یقینا تیرے علاوہ کوئی اور مغفرت فرمانے والا نہیں۔"
        },
        "reference": "Sahih Al-Bukhari"
      },
      {
        "index": 3,
        "arabic": "اللَّهُمَّ رَبَّ النَّبِيِّ مُحَمَّدٍ اغْفِرْ لِي ذَنْبِي، وَأَذْهِبْ غَيْظَ قَلْبِي، وَأَجِرْنِي مِنْ مُضِلَّاتِ الْفِتَنِ مَا أَحْيَيْتَنَا",
        "translations": {
          "en": "O Allah, make us among those who remember You",
          "ur": "اے اللہ! اے محمد ﷺ کے پروردگار! تو میرے گناہوں کو معاف فرما اور میرے دل کے غصہ ونفرت کو دور فرما۔ اور زندگی کی آخری سانس تک گمراہ کن فتنوں سے میری حفاظت فرما۔ "
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 4,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتَ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا ",
        "translations": {
          "en": "O Allah, make us among those who remember You",
          "ur": "اے اللہ میں تجھ سے سوال کرتا ہوں ہرخیر کا، خواہ وہ فوری طور پر ملنے والا ہو یا بعد میں، خواہ وہ میرے علم میں ہو یا نہ ہو، اور ان تمام برائیوں سے تیری پناہ چاہتا ہوں جو میرے علم میں ہیں اور جو نہیں ہیں، اے اللہ میں تجھ سے ہر اس خیر کا سوال کرتا ہوں، جو تجھ سے تیرے برگزیدہ بندے اور تیرے نبی(محمدؐ) نے مانگا ہے۔ اور ہر اس برائی سے تیری پناہ چاہتا ہوں جس سے تیرے برگزیدہ بندے اور تیرے بنی نے پناہ مانگی ہے۔ اے اللہ میں تجھ سے جنت اور اس سے قریب کردینے والے اعمال مانگتا ہوں خواہ وہ عمل قولی ہو یا فعلی۔ اور جہنم اور جہنم سے قریب کردینے والے اعمال سے تیری پناہ مانگتا ہوں خواہ و ہ قولی ہو یا فعلی۔ اور میں تجھ سے سوال کرتا ہوں کہ اپنی تقدیر کے ہر فیصلہ کو میرے حق میں بہتر بنادے۔ "
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 5,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رَحْمَةً مِنْ عِنْدِكَ تَهْدِي بِهَا قَلْبِي، وَتَجْمَعُ بِهَا شَمْلِي، وَتَلُمُّ بِهَا شَعَثِي، وَتَرُدُّ بِهَا أُلْفَتِي، وَتُصْلِحُ بِهَا دِينِي، وَتَحْفَظُ بِهَا غَائِبِي، وَتَرْفَعُ بِهَا شَاهِدَيْ، وَتُزَكِّي بِهَا عَمَلِي، وَتُبَيِّضُ بِهَا وَجْهِي، وَتُلْهِمُنِي بِهَا رُشْدِي وَتَعْصِمُنِي بِهَا مِنْ كُلِّ سُوءٍ. ",
        "translations": {
          "en": "O Allah, have mercy on our deceased",
          "ur": "اے اللہ میں تجھ سے تیری ایسی رحمت مانگتا ہوں جس سے تو میرے دل کو ہدایت کردے، اور اس سے میرے کاموں میں جمعیت دے (یعنی دل کے سکون کے ساتھ تمام کام ہوجایا کریں)۔ اور اس سے میری پریشانی کو دور فرما دے، اور میری الفت واپس کر دے، اور اس سے میرے دین کی اصلاح فرمادے اور اس کے ذریعہ سے نظر سے دورمیری چیزوں کی حفاظت فرما اور میرے سامنے موجود چیزوں کو بلندی عطا کر، اور اس رحمت سے میرا عمل پاکیزہ کردے، اور اس سے میرے چہرہ کو نورانیت بخش دے اور اس سے صحیح رہنمائی میرے دل میں ڈال دے اور اس کے صدقہ میں مجھے ہر برائی سے بچائے رکھ۔ "
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 6,
        "arabic": "اللَّهُمَّ أَعْطِنِي إِيمَانًا صَادِقًا، وَيَقِينًا لَيْسَ بَعْدَهُ كُفْرٌ، وَرَحْمَةً أَنَالُ بِهَا شَرَفَ كَرَامَتِكَ فِي الدُّنْيَا وَالْآخِرَةِ. ",
        "translations": {
          "en": "Our Lord, give us good in this world",
          "ur": "اے اللہ مجھے ایسا سچا ایمان اور یقین عطا فرما جس کے بعد کفر نہ ہو، اور ایسی رحمت خاص عطا فرما جس سے میں دنیا و آخرت میں تیری طرف سے عزت وشرف حاصل کرسکوں۔ "
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 7,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْفَوْزَ عِنْدَ اللِّقَاءِ، وَمَنْزِلَ الشُّهَدَاءِ، وَعَيْشَ السُّعَدَاءِ، وَمُرَافَقَةَ الْأَنْبِيَاءِ، وَالنَّصْرَ عَلَى الْأَعْدَاءِ. ",
        "translations": {
          "en": "O Allah, forgive our sins",
          "ur": "اے اللہ میں تجھ سے مانگتا ہوں ملاقات کے وقت کامیابی، اور شہداء کرام کا سا ٹھکانہ، نیک بختوں جیسی زندگی اور انبیاء کی رفاقت و صحبت اور دشمنوں پر فتح ۔ "
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 8,
        "arabic": "اللَّهُمَّ أَنْزَلْتُ بِكَ حَاجَتِي، وَإِنَّ قَصَّرَ رَأْيِي وَضَعُفَ عَمَلِي، وَافْتَقَرْتُ إِلَى رَحْمَتِكَ، فَأَسْأَلُكَ يَا قَاضِيَ الْأُمُورِ وَيَا شَافِيَ الصُّدُورِ كَمَا تُجِيرُ بَيْنَ الْبُحُورِ أَنْ تُجِيرَنِي مِنْ عَذَابِ السَّعِيرِ، وَمِنْ دَعْوَةِ الثُّبُورِ، وَمِنْ فِتْنَةِ الْقُبُورِ، اللَّهُمَّ مَا قَصُرَ عَنْهُ رَأْيِي وَضَعُفَ مِنْهُ عَمَلِي وَلَمْ تَبْلُغْهُ أُمْنِيَّتِي مِنْ خَيْرٍ وَعَدْتَهُ أَحَدًا مِنْ عِبَادِكَ أَوْ خَيْرًا أَنْتَ مُعْطِيهِ أَحَدًا مِنْ خَلْقِكَ فَإِنِّي أَرْغَبُ إِلَيْكَ فِيهِ وَأَسْأَلُكَ يَا رَبَّ الْعَالَمِينَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ میں اپنی ضرورت تیرے سامنے پیش کرتا ہوں، میری عقل و رائے کوتاہ اور عمل کمزور ہے مگر میں تیری رحمت کا محتاج ہوں۔ تو اے کاموں کو پورا کرنے والے، سینوں کو شفا بخشنے والے! جس طرح تو سمندر کے درمیان (ڈوبنے سے) بچاتا ہے، اسی طرح تو مجھے جہنم کے عذاب سے اور جہنم کی چیخ و پکار سے بچالے اور قبر کے فتنوں سے میری حفاظت فرما۔ اے اللہ جو بھلائی بھی ایسی ہو کہ اس تک پہنچنے سے میری سمجھ قاصر اور میر اعمل کمزور ہو۔ اور میری تمنا کی پہنچ وہاں تک نہ ہو، اور تو نے اپنے بندوں میں سے کسی سے بھی اس کا وعدہ کیا ہو، یا اپنی مخلوق میں سے کسی کو بھی وہ بھلائی عطا کرنے والا ہو تو میں بھی تجھ سے اُسکی خواہش کا اظہار کرتا اور سوال کرتا ہوں، اے تمام کائنات کے پالنہار"
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 9,
        "arabic": "اللَّهُمَّ اجْعَلْنَا هَادِينَ مَهْدِيِّينَ غَيْرَ ضَالِّينَ وَلَا مُضِلِّينَ، حَرْبًا لِأَعْدَائِكَ وَسِلْمًا لِأَوْلِيَائِكَ، نُحِبُّ بِحُبِّكَ النَّاسَ، وَنُعَادِي بِعَدَاوَتِكَ مَنْ خَالَفَكَ مِنْ خَلْقِكَ. اللَّهُمَّ هَذَا الدُّعَاءُ وَعَلَيْكَ الْإِجَابَةُ، اللَّهُمَّ وَهَذَا الْجَهْدُ وَعَلَيْكَ التُّكْلَانُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ تو ہمیں ہادی ومہدی بنادے، گمراہ ہونے اور کرنے والا نہ بنا،ہمیں خدا کے دشمنوں کادشمن اوراُس کے دوستوں کادوست بنا، ہم لوگوں سے تیری محبت ورضا کی خاطر ہی محبت کریں اورتیری مخلوق میں سے سے جس نے تیری مخالفت کی ہم اُس سے تیری خاطر بیر رکھیں۔ اے اللہ! یہ ہماری دعا ہے اور قبول کرنا تیرا کام۔ یہ ہماری محنت و کوشش ہے ، مگر بھروسہ و توکل تو تیرے ہی اوپر ہے۔ کوئی طاقت وقوت والا نہیں سوائے اللہ کے۔"
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 10,
        "arabic": "اللَّهُمَّ ذَا الْحَبْلِ الشَّدِيدِ وَالْأَمْرِ الرَّشِيدِ أَسْأَلُكَ الْأَمْنَ يَوْمَ الْوَعِيدِ، وَالْجَنَّةَ يَوْمَ الْخُلُودِ مَعَ الْمُقَرَّبِينَ الشُّهُودِ وَالرُّكَّعِ السُّجُودِ وَالْمُوفِينَ بِالْعُهُودِ إِنَّكَ رَحِيمٌ وَدُودٌ، وَإِنَّكَ تَفْعَلُ مَا تُرِيدُ. سُبْحَانَ الَّذِي تَعَطَّفَ بِالْعِزِّ وَقَالَ بِهِ، سُبْحَانَ الَّذِي لَا يَنْبَغِي التَّسْبِيحُ إِلَّا لَهُ، سُبْحَانَ ذِي الْعِزِّ وَالْبَهَاءِ، سُبْحَانَ ذِي الْقُدْرَةِ وَالْكَرَمِ، سُبْحَانَ الَّذِي أَحْصَى كُلَّ شَيْءٍ بِعِلْمِهَِ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ، اے مضبوط طاقت والے، اے صحیح راہ دکھانے والے! میں تجھ سے سوالی ہوں وعید کے دن (حشر) کے امن کا اورہمیشہ کی جنت کا، تیرے حاضر باش مقرب فرشتوں کے ساتھ، اور تیرے عبادت گزار، کثرت سے رکوع و سجدہ کرنے والے اوراپنے عہدوں کو پورا کرنے والے نیک بندوں کے ساتھ۔ تو تو بڑا ہی مہربان اور محبت و شفقت فرمانے والا ہے، بے شک تو جو کچھ چاہے کرسکتا ہے۔ پاک ہے وہ ذات والا جس نے عزت کا جامہ پہنا اور عزت کے کلمات ارشاد فرمائے، پاک ہے وہ ذات جس کے علاوہ کوئی تسبیح و تحمید کے لائق نہیں،پاک ہے غلبہ وشان کا مالک، پاک ہے وہ جو بہت قدرت وکرم والا ہے۔ پاک ہے وہ جو تمام اشیاء کا علم رکھتا ہے۔"
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 11,
        "arabic": "اللَّهُمَّ اجْعَلْ لِي نُورًا فِي قَلْبِي، وَنُورًا فِي قَبْرِي، وَنُورًا فِي سَمْعِي، وَنُورًا فِي بَصَرِي، وَنُورًا فِي شَعْرِي، وَنُورًا فِي بَشَرِي، وَنُورًا فِي لَحْمِي، وَنُورًا فِي دَمِي، وَنُورًا فِي عِظَامِي، وَنُورًا بَيْنَ يَدَيَّ، وَنُورًا مِنْ خَلْفِي: وَنُورًا عَنْ يَمِينِي، وَنُورًا عَنْ شِمَالِي، وَنُورًا مِنْ فَوْقِي، وَنُورًا مِنْ تَحْتِي، اللَّهُمَّ زِدْنِي نُورًا، وَأَعْظِمْ لِي نُورًا، وَاجْعَلْ لِي نُورًا",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میرے دل میں نور پیدا کردے، اور میری قبر میں نور پیدا کردے، میری سماعت میں نور پیدا کردے، میری بصارت میں نور پیدا کردے، میرے بالوں میں نور پیدا کردے، میری کھال میں، میرے گوشت، میرے خون اور میری ہڈی میں نور پیدا کردے۔ میرے آگے، میرے پیچھے، میرے دائیں اور میرے بائیں نور کردے، میرے اوپر اور میرے نیچے نور کردے۔ اے اللہ مجھے نور ہی میں دے دے، مجھے عظیم نور عطا فرما اور مجھے سراپا نور بنادے۔"
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 12,
        "arabic": "اللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي وَانْقِطَاعِ عُمْرِي.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! بڑھاپے اور عمر کے آخری حصے میں مجھ پررزق اور زیادہ وسیع فرما دینا۔"
        },
        "reference": "Al-Mustadrak ala aṣ-Ṣaḥeeḥayn"
      },
      {
        "index": 13,
        "arabic": "اللَّهُمَّ زِدْنَا وَلاَ تَنْقُصْنَا، وَأَكْرِمْنَا وَلاَ تُهِنَّا، وَأَعْطِنَا وَلاَ تَحْرِمْنَا، وَآثِرْنَا وَلاَ تُؤْثِرْ عَلَيْنَا، وَأَرْضِنَا وَارْضَ عَنَّا.",
        "translations": {
          "en": "",
          "ur": "اے اللہ تو ہمارے لیے نعمتوں میں زیادتی فرما، کمی نہ کر۔ ہم کو عزتوں سے نواز، ذلیل نہ کر۔ ہم کو عطا فرما، محروم نہ رکھ۔ ہم کو ترجیح دے اور ہمارے اوپر کسی کو ترجیح نہ دے۔ اور ہم کو خوش رکھ اور تو خودہم سے راضی ہوجا۔"
        },
        "reference": "Sunan al-Tirmidhi"
      },
      {
        "index": 14,
        "arabic": "اللَّهُمَّ لَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَلَا تَنْزِعْ مِنِّي صَالِحَ مَا أَعْطَيْتَنِي.",
        "translations": {
          "en": "",
          "ur": "اے اللہ تومیرے معاملے کو پلک جھپکنے کے بقدر بھی میرے نفس کے حوالے نہ کر، اور جن اچھی نعمتوں سے تو نے مجھے نوازا ہے ان کو مجھ سے نہ چھین۔"
        },
        "reference": "Rawāhu al-Bazzāru"
      },
      {
        "index": 15,
        "arabic": "اللَّهُمَّ قِنِي شَرَّ نَفْسِي، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي",
        "translations": {
          "en": "",
          "ur": "اے اللہ میرے نفس کی شرارت سے میری حفاظت فرما اور صحیح راستہ اختیار کرنے کا عزم و قوت عطا فرما۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 16,
        "arabic": "اللَّهُمَّ أَقْبِلْ بِقَلْبِي عَلَى دِينِكَ، وَاحْفَظْ مِنْ وَرَائَنَا بِرَحْمَتِكَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ میرے دل کو اپنے دین کی طرف متوجہ کردے، اور اپنی خاص رحمت کے ذریعہ ہمارے پچھلے لوگوںکی حفاظت فرما۔"
        },
        "reference": "Musnad Abū Yaʿlā"
      },
      {
        "index": 17,
        "arabic": "اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ، وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ میری عمرکے آخری حصہ کو بہترین حصہ بنادے۔ میرے آخری عمل کو میرا بہترین عمل بنادے، اور میرا سب سے بہتر دن وہ ہو، جس دن میں تیرے سامنے حاضر ہوں۔"
        },
        "reference": "Muṣannaf Ibn Abī Shaybah"
      },
      {
        "index": 18,
        "arabic": "اللَّهُمَّ إِنِّي ضَعِيفٌ فَقَوِّ فِي رِضَاكَ ضَعْفِي، وَخُذْ إلى الْخَيْرِ بِنَاصِيَتِي، وَاجْعَلِ الْإِسْلَامَ مُنْتَهَى رِضَائِي، وَإِنِّي ذَلِيلٌ فَأَعِزَّنِي، وَإِنِّي فَقِيرٌ فَارْزُقْنِي.", 
        "translations": {
          "en": "TODO: validate Arabic dua above",
          "ur": "اے اللہ میں کمزور وناتواں ہوں لہٰذا اپنی رضا کے کاموں میں میری کمزوری کو قوت سے بدل دے، اور مجھے خیر کی طرف کھینچ لا، اور اسلام کو میری انتہائی پسند بنادے۔اے اللہ میں کمزور وضعیف ہوں تو مجھ کو قوت عطا فرما، میں کمزور ہوں تو مجھے طاقت عطا فرما، میں فقیر ہوں، مجھے بے نیاز بنا۔ تیری رحمت کا واسطہ ہے، اے ارحم الراحمین۔"
        },
        "reference": "Rawāhu al-Ḥākim"
      },
      {
        "index": 19,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً نَقِيَّةً، وَمِيتَةً سَوِيَّةً، وَمَرَدًّا غَيْرَ مُخْزٍ وَلَا فَاضِحٍ",
        "translations": {
          "en": "",
          "ur": "اے اللہ میں سوال کرتا ہوں تجھ سے پاکیزہ زندگی کا اور ڈھنگ کی موت کا۔ اور ایسے انجام کا جس میں نہ ذلت و رسوائی ہو اور نہ فضیحت ہو۔"
        },
        "reference": "Rawāhu at-Tabarāni wal-Bazzāru"
      },
      {
        "index": 20,
        "arabic": "اللهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ الْأَشْيَاءِ إِلَيَّ وَاجْعَلْ خَوْفَكَ أَخْوَفَ الْأَشْيَاءِ عِنْدِي وَاقْطَعْ عَنِّي حَاجَاتِ الدُّنْيَا بِالشَّوْقِ إِلَى لِقَائِكَ وَإِذَا أَقْرَرْتَ أَعْيُنَ أَهْلِ الدُّنْيَا مِنْ دُنْيَاهُمْ فَأَقِرَّ عَيْنِي مِنْ عِبَادَتِكَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میرے دل میں اپنی محبت کو ساری محبتوں پر غالب فرما۔ اور اپنا خوف سارے ڈروں پر غالب فرما۔اور مجھے اپنی ملاقات کا ایسا مشتاق بنا دے کہ دنیا کی ضرورتوں سے میرا پیچھا چھوٹ جائے۔اور جب تو نے دنیا والوں کی آنکھیں ان کی دنیا سے ٹھنڈی کی ہیں تو میری آنکھیں اپنی عبادت سے ٹھنڈی فرما۔"
        },
        "reference": "Ḥilyat al-Awliyā"
      },
      {
        "index": 21,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهُمَا إِلَّا أَنْتَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میں تجھ ہی سے دنیوی نعمتوں کا فضل اور دینی انعامات کی رحمت مانگتا ہوں، اس لیے کہ ان دونوں کا مالک صرف تو ہی ہے۔"
        },
        "reference": "Al-Muʿjam al-Kabīr"
      },
      {
        "index": 22,
        "arabic": "اللَّهُمَّ افْتَحْ مَسَامِعَ قَلْبِي لِذِكْرِكَ، وَارْزُقْنِي طَاعَتَكَ وَطَاعَةَ رَسُولِكَ، وَعَمَلًا بِكِتَابِكَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میرے دل کے دریچوں کو اپنے ذکر کے لیے کھول دے، اور مجھے اپنی اور اپنے رسول کی طاعت و فرما نبرداری اور اپنی کتاب پر عمل کرنے کی توفیق نصیب فرما۔"
        },
        "reference": "Al-Du'a li'l-Tabarānī"
      },
      {
        "index": 23,
        "arabic": "اللهُمَّ إِنِّي أَسْأَلُكَ التَّوْفِيقَ لِمَحَابِّكَ مِنَ الْأَعْمَالِ، وَصِدْقَ التَّوَكُّلِ عَلَيْكَ وَحُسْنَ الظَّنِّ بِكَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میں تجھ سے تیری مرضیات پر عمل کی توفیق مانگتا ہوں، تیرے اوپر سچا توکل و بھروسہ مانگتا ہوں، اور تجھ سے ہمیشہ حسن ظن رکھنے کا سوال کرتا ہوں۔"
        },
        "reference": "Ḥilyat al-Awliyā"
      }
    ],
    "saturday": [
      {
        "index": 1,
        "arabic": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي خَطَئِي وَعَمْدِي، اللَّهُمَّ إِنِّي أَسْتَهْدِيكَ لِأَرْشَدِ أَمْرِي، وَأَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي؟",
        "translations": {
          "en": "",
          "ur": "اے اللہ! تو میرے گناہوں کو معاف فرما، غلطی سے ہوجانے والے گناہوں کو بھی اور قصداً کئے جانے والے گناہوں کو بھی۔ اے اللہ مجھے سب سے صحیح راستے پر چلا،اور میں تیری پناہ مانگتا ہوں اپنے نفس کے شر سے ۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 2,
        "arabic": "اللَّهُمَّ أَعِنِّي عَلَى دِيْنِيْ بِالدُّنْيَا وَعَلَى آخِرَتِي بِالتَّقْوَى وَاحْفَظْنِي فِيمَا غِبْتُ عَنْهُ وَلَا تَكِلْنِي إِلَيَّ فِيْمَا حَضَرْتُ يَا مَنْ لَا تَضُرُّهُ الذُّنُوبُ وَلَا تَنْقُصُهُ الْمَغْفِرَة. هَبْ لِي مَا لَا يَنْقُصُكَ وَاغْفِرْ لِي مَا لَا يَضُرّك.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! مجھے اتنی دنیا عطا فرما جس سے مجھے دین میں مدد ملے، اور مجھے اپنا ایسا خوف دے جس سے میری آخرت سنور جائے، اور میری نظر سے دور رہنے والی چیزوں کی حفاظت فرما، اور نظر کے سامنے کی چیزوں میں بھی میرا معاملہ میرے حوالے نہ فرما۔ اے وہ بلند ذات جس کا نہ گناہ کچھ بگاڑ سکتے ہیں اور نہ مغفرت کی اس کے خزانے میں کمی ہے۔سو تو مجھے وہ مغفرت دے دے جس کی تیرے خزانے میں کوئی کمی نہیں، اوران گناہوں کو نظر انداز کر دے جن سے تیرا کچھ نقصان نہیں ہوتا۔"
        },
        "reference": "Ibn Asakir"
      },
      {
        "index": 3,
        "arabic": "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میں اپنے کردہ وناکردہ گناہوں کے شر سے آپ کی پناہ مانگتا ہوں۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 4,
        "arabic": "اللَّهُمَّ اجْعَلْنِي أُعَظِّمُ شُكْرَكَ، وَأُكْثِرُ ذِكْرَكَ، وَأَتَّبِعُ نَصِيحَتَكَ، وَأَحْفَظُ وَصِيَّتَكَ.",
        "translations": {
          "en": "",
          "ur": "یا اللہ! مجھے ایسا بنادے کہ میں تیرا بڑا شکر ادا کیا کروں اور تیرا بہت کثرت سے ذکر کرتا رہوں اور تیری نصیحتوں کی پیروی کرتا رہوں اور تیرے تاکیدی احکام کو یاد رکھا کروں۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 5,
        "arabic": "اللَّهُمَّ أعطني إِيمَانًا يُبَاشِرُ قَلْبِي حَتَّى أَعْلَمَ أَلا يُصِيبَنِي إلاَّ مَا كَتَبْتَ لِي وَرِضًا مِنَ الْمَعِيشَةِ بِمَا قَسَمْتَ لِي.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! مجھے ایسا ایمان عطا فرمادیجیے جو میرے دل میں اترجائے اور پھر میرا یہ یقین ہوجائے کہ مجھے بس وہی مل سکتا ہے جوآپ میرے لیے لکھ چکے ہیں۔ اور مجھے اطمینان وقناعت عطافرمادیجیے اتنے زندگی کے سامان پر جتناآپ نے میری قسمت میں لکھ دیا ہے۔"
        },
        "reference": "Musnad Al-Bazzar"
      },
      {
        "index": 6,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا لَا يَرْتَدُّ، وَنَعِيمًا لَا يَنْفَدُ، وَمُرَافَقَةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَعْلَى جُنَّةِ الْخُلْدِ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میں آپ سے نہ پھِرنے والا ایمان، ہمیشہ کی نعمتیں اور جنت کے اعلیٰ مقام میں اپنے نبی جناب محمد صلی اللہ علیہ وسلم کا ساتھ طلب کرتا ہوں۔"
        },
        "reference": "Sahih Ibn Hibban"
      },
      {
        "index": 7,
        "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ، وَإِلَيْكَ الْمُشْتَكَى، وَأَنْتَ الْمُسْتَعَانُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيم",
        "translations": {
          "en": "",
          "ur": "اے اللہ! ساری تعریف آپ کے لیے ہے، اور (اپنی تکلیف کی) شکایت بھی آپ سے ہی ہے۔میں آپ ہی سے مدد طلب کرتا ہوں۔ نہیں ہے کوئی طاقت اور قوت مگر اللہ تعالیٰ ہی کی مدد سے۔"
        },
        "reference": "Al-Mu'jam Al-Awsat"
      },
      {
        "index": 8,
        "arabic": "اللّهُمَّ إِنَّكَ تَسْمَعُ كَلَامِي، وَتَرَى مَكَانِي، وَتَعْلَمُ سِرِّي وعلانيتِي، لَا يَخْفَى عَلَيْكَ شَيْءٌ مِنْ أَمْرِي، وَأَنَا الْبَائِسُ الْفَقِير، الْمُسْتَغِيثُ الْمُسْتَجِير، وَالْوَجِلُ الْمُشْفِقُ الْمُقِرُّ الْمُعْتَرِفُ بِذَنَبِهِ، أَسْأَلُكَ مَسْأَلَةَ الْمستكينِ وَأَبْتَهِلُ إِلَيْكَ ابْتِهَالَ الْمُذْنِبِ الذَّلِيلِ، وَأَدْعُوكَ دُعَاءَ الْخَائِفِ الضَّرِيرِ، دُعَاءَ مَنْ خَضَعَتْ لَكَ رَقَبَتُهُ وَفَاضَتْ لَكَ عَيْنَاهُ وذلَّ جَسَدُهُ وَرَغِمَ لك أَنْفُهُ، اللّهُمَّ لَا تَجْعَلْنِي بدُعائِكَ شَقِيًّا، وَكُنْ بِي رَؤُوْفًا رَحِيمًا، يَا خَيْرَ الْمَسْئُولينَ وَيَا خَيْرَ الْمُعْطِينَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ آپ میری بات سن رہے ہیں، میں جہاں اور جس حال میں ہوں آپ اسے دیکھتے ہیں۔ آپ میرے ظاہر وباطن سے باخبر ہیں۔ میری کوئی بات آپ سے مخفی نہیں، میں دُکھی ہوں، محتاج ہوں، فریادی اور پناہ جو ہوں، ترساں وہراساں ہوں، اپنے گناہوں کااقراری ہوں،آپ سے ایک بے کس کی طرح سوال کرتا ہوں اورآپ کے آگے ایک گنہگارو ذلیل بندہ کی طرح گڑگڑاتا ہوں، اور خوف زدہ آفت رسیدہ شخص کی طرح آپ کو پکارتا ہوں، اس شخص کی طرح دعا مانگتا ہوں جس کی گردن آپ کے سامنے جھکی ہوئی ہو اور اس کے آنسو بہہ رہے ہوں، تن بدن سے آپ کے سامنے فروتنی کیے ہوئے ہو اور اپنی ناک آپ کے سامنے رگڑ رہا ہو۔ اے اللہ مجھے اس دعا مانگنے میں محروم نہ رکھیو، اور میرے حق میں بڑے مہربان ونہایت رحیم ہوجائیو۔ اے سب سے بہتر وبرتر جن سے مانگنے والے مانگتے ہیں اور جو مانگنے والوں کو دیتے ہیں۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 9,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَالعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ، اللَّهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ إِلَيَّ مِنْ نَفْسِي وَأَهْلِي، وَمِنَ المَاءِ البَارِدِ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میں آپ سے مانگتا ہوں آپ کی محبت،آپ سے محبت رکھنے والے بندوں کی محبت ، اورآپ سے ایسے اعمال کی توفیق کاسوال کرتا ہوں جو مجھے آپ کا محبوب بنا دیں۔ اے اللہ! اپنی محبت کو میرے لیے اپنی جان،اہل وعیال اور ٹھنڈے پانی سے بھی زیادہ محبوب بنادے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 10,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ كُلِّ عَمَلٍ يُخْزِينِي، وَأَعُوذُ بِكَ مِنْ صَاحِبٍ يُرْدِينِي، وَأَعُوذُ بِكَ مِنْ كُلِّ أَمَلٍ يُلْهِينِي، وَأَعُوذُ بِكَ مِنْ كُلِّ فَقْرٍ يُنْسِينِي، وَأَعُوذُ بِكَ مِنْ كُلِّ غِنًى يُطْغِينِي.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! میں تیری پناہ چاہتا ہوں ہر ایسے عمل سے جو مجھے رسوا کردے اورایسے ساتھی سے جو مجھے برباد کردے، اور ہر ایسی خواہش وتمنا سے جو مجھے ہلاک کردے، اور ایسی غربت سے جو ہوش نہ چھوڑے، اور ایسی دولت سے جو سرکش بنادے۔"
        },
        "reference": "Rawah Al-Bazzar"
      },
      {
        "index": 11,
        "arabic": "اللّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ، وَالْكَسَلِ، وَالْجُبْنِ، وَالْبُخْلِ، وَالْهَرَمِ، وَعَذَابِ الْقَبْرِ. اللهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا.",
        "translations": {
          "en": "",
          "ur": "اے اللہ میں آپ کی پناہ مانگتا ہوںلاچارگی، سستی، بزدلی، بخل، برے بڑھاپے اور عذاب قبر سے۔ اے اللہ میرے نفس کو تقویٰ کی دولت نصیب فرمائیے اور اس کا تزکیہ فرما دیجیے (پاک صاف کردیجیے)۔ آپ نفوس کا بہترین تزکیہ کرنے والے ہیں۔آپ ہی میرے نفس کے مالک و آقا ہیں۔ اے اللہ! آپ کی پناہ ایسے علم سے جو نفع نہ دے اور ایسے دل سے جس میں آپ کا ڈر نہ ہو، اور ایسے پیٹ سے جو نہ بھرے، اور ایسی دعا سے جو قبول نہ ہو۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 12,
        "arabic": "اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَأَنْتَ الْمُسْتَعَانُ، وَعَلَيْكَ البَلاَغُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ ہم تجھ سے ان ساری بھلائیوں کا سوال کرتے ہیں جو تیرے نبی جناب محمد صلی اللہ علیہ وسلم نے تجھ سے مانگی ہیں اور ان تمام چیزوں کے شر سے ہم تیری پناہ چاہتے ہیں جن سے تیرے نبی نے پناہ مانگی ہے۔ تجھ ہی سے مدد کا سوال ہے اور تیری ہی مدد سے کام بنتا ہے۔ نہیں ہے کوئی زور اور طاقت کسی میں سوائے اللہ تعالیٰ کے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 13,
        "arabic": "اللَّهُمَّ أَصْلِحْ ذَاتَ بَيْنِنَا، وَأَلِّفْ بَيْنَ قُلُوبِنَا، وَاهْدِنَا سُبُلَ السَّلَامِ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ، وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ. اللَّهُمَّ بَارِكْ لَنَا فِي أَسْمَاعِنَا وَفِي أَبْصَارِنَا، وَقُلُوبِنَا وَأَزْوَاجِنَا، وَذُرِّيَّاتِنَا، وَتُبْ عَلَيْنَا، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ، وَاجْعَلْنَا شَاكِرِينَ لِنِعَمِكَ مُثْنِينَ بِهَا، قَابِلِينَ لَهَا، وَأَتِمَّهَا عَلَيْنَا.",
        "translations": {
          "en": "",
          "ur": "اے اللہ ہمارے آپس کے معاملات درست کردیجیے، ہمارے دلوں میں الفت ومحبت پیدا فرما دیجیے۔ چلا دیجیے ہم کو سلامتی وہدایت کا راستہ اور نکال لیجیے ہم کو تاریکیوں سے روشنی میں۔ ہمیں کھُلی اور چھُپی دونوں قسم کی بے حیائیوں سے دور رکھیے۔ اے اللہ! برکت دے دیجیے ہمارے کانوں، آنکھوں اور دلوں میں، ہماری بیویوں اور اولاد میں، ہماری توبہ قبول فرمائیے۔ آپ بہت ہی توبہ قبول کرنے واے اور بے حد رحم کرنے والے ہیں۔ خدایا!ہم کو اپنی نعمتوں کا قدرداں، ان پر آپ کا ثنا خواں اور شکر کے ساتھ ان کو قبول کرنے والابنائیے، اورہم پرکامل ومکمل نعمتیں نازل فرمائیے۔"
        },
        "reference": "Mu'jam Al-Tabarani"
      },
      {
        "index": 14,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي، وَإِذَا أَرَدْتَ بِقَوْمٍ فِتْنَةً فَتَوَفَّنِي إِلَيْكَ، وَأَنَا غَيْرُ مَفْتُونٍ، اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَحُبًّا يُبَلِّغُنِي حُبَّكَ.",
        "translations": {
          "en": "",
          "ur": "اے اللہ! مجھے توفیق عنایت فرما نیکیوںکی، برائیاں چھوڑنے کی، اور غریبوں سے محبت کی۔اور میں اس کا بھی سوالی ہوں کہ تو میری مغفرت فرما اورمجھ پر رحم فرما۔ اور جب تو کسی قوم کو فتنے اور آزمائش میں ڈالنے کا فیصلہ فرمائے تو مجھے اس فتنے سے بچا کر اپنے پاس بلا لینا۔ اے اللہ میں مانگتا ہوں تجھ سے ان بندوں کی محبت جو تجھ سے محبت رکھتے ہیں اور ایسی محبت کا جو مجھے تیرا محبوب بنا دے۔"
        },
        "reference": "Al-Mustadrak"
      }
    ],
    "sunday": [
      {
        "arabic": "اللهم إني أسألك الهدى والتقى",
        "translations": {
          "en": "O Allah, I ask You for guidance and piety",
          "ur": "اے اللہ! میں آپ سے ہدایت اور تقویٰ مانگتا ہوں۔"
        },
        "reference": "General supplication"
      },
      {
        "arabic": "ربنا آتنا من لدنك رحمة",
        "translations": {
          "en": "Our Lord, grant us mercy from Yourself",
          "ur": "اے ہمارے رب! اپنی طرف سے ہمیں رحمت عطا فرما۔"
        },
        "reference": "Quran 18:10"
      },
      {
        "arabic": "اللهم اجعل القرآن ربيع قلوبنا",
        "translations": {
          "en": "O Allah, make the Quran the spring of our hearts",
          "ur": "اے اللہ! قرآن کو ہمارے دلوں کا بہار بنا دے۔"
        },
        "reference": "General supplication"
      }
    ],
    "monday": [
      {
        "arabic": "اللهم صل على محمد وعلى آل محمد",
        "translations": {
          "en": "O Allah, send blessings upon Muhammad and the family of Muhammad",
          "ur": "اے اللہ! محمد اور آل محمد پر درود بھیج۔"
        },
        "reference": "Salawat"
      },
      {
        "arabic": "ربنا تقبل منا إنك أنت السميع العليم",
        "translations": {
          "en": "Our Lord, accept from us. Indeed, You are the Hearing, the Knowing",
          "ur": "اے ہمارے رب! ہم سے قبول فرما، بے شک آپ سننے والے جاننے والے ہیں۔"
        },
        "reference": "Quran 2:127"
      },
      {
        "arabic": "اللهم اهدنا الصراط المستقيم",
        "translations": {
          "en": "O Allah, guide us to the straight path",
          "ur": "اے اللہ! ہمیں سیدھے راستے کی ہدایت دے۔"
        },
        "reference": "Quran 1:6"
      }
    ],
    "tuesday": [
      {
        "arabic": "اللهم إني أعوذ بك من الهم والحزن",
        "translations": {
          "en": "O Allah, I seek refuge in You from worry and grief",
          "ur": "اے اللہ! میں آپ کی پناہ مانگتا ہوں پریشانی اور غم سے۔"
        },
        "reference": "General supplication"
      },
      {
        "arabic": "ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان",
        "translations": {
          "en": "Our Lord, forgive us and our brothers who preceded us in faith",
          "ur": "اے ہمارے رب! ہمیں اور ہمارے بھائیوں کو معاف فرما جو ہم سے پہلے ایمان لائے۔"
        },
        "reference": "Quran 59:10"
      },
      {
        "arabic": "اللهم اجعلنا من التوابين",
        "translations": {
          "en": "O Allah, make us among those who repent",
          "ur": "اے اللہ! ہمیں توبہ کرنے والوں میں شامل فرما۔"
        },
        "reference": "General supplication"
      }
    ],
    "wednesday": [
      {
        "arabic": "اللهم إني أسألك العفو والعافية",
        "translations": {
          "en": "O Allah, I ask You for pardon and well-being",
          "ur": "اے اللہ! میں آپ سے معافی اور عافیت مانگتا ہوں۔"
        },
        "reference": "General supplication"
      },
      {
        "arabic": "ربنا لا تجعلنا فتنة للقوم الظالمين",
        "translations": {
          "en": "Our Lord, do not make us a trial for the wrongdoing people",
          "ur": "اے ہمارے رب! ہمیں ظالم لوگوں کے لیے آزمائش نہ بنا۔"
        },
        "reference": "Quran 10:85"
      },
      {
        "arabic": "اللهم بارك لنا في أموالنا",
        "translations": {
          "en": "O Allah, bless us in our wealth",
          "ur": "اے اللہ! ہمارے مال میں برکت عطا فرما۔"
        },
        "reference": "General supplication"
      }
    ],
    "thursday": [
      {
        "arabic": "اللهم إني أسألك الجنة وأعوذ بك من النار",
        "translations": {
          "en": "O Allah, I ask You for Paradise and seek refuge in You from Hell",
          "ur": "اے اللہ! میں آپ سے جنت مانگتا ہوں اور جہنم سے آپ کی پناہ مانگتا ہوں۔"
        },
        "reference": "General supplication"
      },
      {
        "arabic": "ولما كان تناسي حقوق الإنسان وازدراؤها قد أفضيا إلى أعمال همجية",
        "translations": {
          "en": "Our Lord, grant us mercy from Yourself and prepare for us from our affair right guidance",
          "ur": "اے ہمارے رب! اپنی طرف سے ہمیں رحمت عطا فرما اور ہمارے کام میں ہدایت تیار کر۔"
        },
        "reference": "Quran 18:10"
      },
      {
        "arabic": "",
        "translations": {
          "en": "O Allah, make us among those who are grateful",
          "ur": "اے اللہ! ہمیں شکر گزاروں میں شامل فرما۔"
        },
        "reference": "General supplication"
      }
    ]
  }
}
