{
  "schema_version": "1.0",
  "days": {
    "friday": [
      {
        "index": 1,
        "arabic": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُور",
        "translations": {
          "en": "O my Lord! Forgive me and accept my repentance, indeed You are the Accepter of Repentance, the Most Forgiving.",
          "ur": "اے میرے رب! میری مغفرت فرما اور میری توبہ قبول فرما، بے شک توبڑا ہی توبہ قبول کرنے والا اور نہایت معاف کرنے والا ہے۔ "
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 2,
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْت",
        "translations": {
          "en": "O Allah, You are my Lord. There is no deity worthy of worship except You. You created me and I am Your servant. I will abide by my covenant and promise to You as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favors upon me and I acknowledge my sins. So forgive me, for none can forgive sins except You.",
          "ur": "اے اللہ تو ہی میرا رب ہے۔ تیرے سوا کوئی عبادت کے لائق نہیں، تو ہی میرا خالق اور میں تیرا ہی بندہ ، عہد کرتا ہوں کہ جتنا ہوسکے گا تجھ سے کیے گئے (بندگی وفرماں برداری کے)وعدے پر قائم رہوں گا۔ میں اپنے برے اعمال کے شر سے تیری پناہ چاہتا ہوں۔ اپنے اوپرتیرے احسانات کا اعتراف کرتا ہوں اور اپنے گناہوں کااقرار کرتا ہوں۔ پس تو میری مغفرت فرمادے، یقینا تیرے علاوہ کوئی اور مغفرت فرمانے والا نہیں۔"
        },
        "reference": "Sahih Al-Bukhari"
      },
      {
        "index": 3,
        "arabic": "اللَّهُمَّ رَبَّ النَّبِيِّ مُحَمَّدٍ اغْفِرْ لِي ذَنْبِي، وَأَذْهِبْ غَيْظَ قَلْبِي، وَأَجِرْنِي مِنْ مُضِلَّاتِ الْفِتَنِ مَا أَحْيَيْتَنَا",
        "translations": {
          "en": "O Allah, Lord of the Prophet Muhammad (peace be upon him)! Forgive my sins and remove the anger and hatred from my heart. And protect me from misleading trials until the last breath of my life.",
          "ur": "اے اللہ! اے محمد ﷺ کے پروردگار! تو میرے گناہوں کو معاف فرما اور میرے دل کے غصہ ونفرت کو دور فرما۔ اور زندگی کی آخری سانس تک گمراہ کن فتنوں سے میری حفاظت فرما۔ "
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 4,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتَ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا ",
        "translations": {
          "en": "O Allah, I ask You for all good, whether immediate or delayed, that which I know and that which I do not know. And I seek refuge in You from all evil, that which I know and that which I do not know. O Allah, I ask You for all the good that Your servant and Your Prophet (Muhammad, peace be upon him) asked You for. And I seek refuge in You from all the evil from which Your servant and Your Prophet sought refuge. O Allah, I ask You for Paradise and for that which brings one closer to it, in word and deed. And I seek refuge in You from Hell and from that which brings one closer to it, in word and deed. And I ask You to make every decree You make for me good."
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 5,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رَحْمَةً مِنْ عِنْدِكَ تَهْدِي بِهَا قَلْبِي، وَتَجْمَعُ بِهَا شَمْلِي، وَتَلُمُّ بِهَا شَعَثِي، وَتَرُدُّ بِهَا أُلْفَتِي، وَتُصْلِحُ بِهَا دِينِي، وَتَحْفَظُ بِهَا غَائِبِي، وَتَرْفَعُ بِهَا شَاهِدَيْ، وَتُزَكِّي بِهَا عَمَلِي، وَتُبَيِّضُ بِهَا وَجْهِي، وَتُلْهِمُنِي بِهَا رُشْدِي وَتَعْصِمُنِي بِهَا مِنْ كُلِّ سُوءٍ. ",
        "translations": {
          "en": "O Allah, I ask You for mercy from You that guides my heart, brings together my affairs, gathers my scattered matters, restores my affection, reforms my religion, protects what is absent from me, elevates what is present before me, purifies my deeds, brightens my face, inspires me with guidance, and protects me from every evil.",
          "ur": "اے اللہ میں تجھ سے تیری ایسی رحمت مانگتا ہوں جس سے تو میرے دل کو ہدایت کردے، اور اس سے میرے کاموں میں جمعیت دے (یعنی دل کے سکون کے ساتھ تمام کام ہوجایا کریں)۔ اور اس سے میری پریشانی کو دور فرما دے، اور میری الفت واپس کر دے، اور اس سے میرے دین کی اصلاح فرمادے اور اس کے ذریعہ سے نظر سے دورمیری چیزوں کی حفاظت فرما اور میرے سامنے موجود چیزوں کو بلندی عطا کر، اور اس رحمت سے میرا عمل پاکیزہ کردے، اور اس سے میرے چہرہ کو نورانیت بخش دے اور اس سے صحیح رہنمائی میرے دل میں ڈال دے اور اس کے صدقہ میں مجھے ہر برائی سے بچائے رکھ۔ "
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 6,
        "arabic": "اللَّهُمَّ أَعْطِنِي إِيمَانًا صَادِقًا، وَيَقِينًا لَيْسَ بَعْدَهُ كُفْرٌ، وَرَحْمَةً أَنَالُ بِهَا شَرَفَ كَرَامَتِكَ فِي الدُّنْيَا وَالْآخِرَةِ. ",
        "translations": {
          "en": "O Allah, grant me sincere faith and certainty after which there is no disbelief, and grant me special mercy through which I may attain honor and dignity from You in this world and the Hereafter.",
          "ur": "اے اللہ مجھے ایسا سچا ایمان اور یقین عطا فرما جس کے بعد کفر نہ ہو، اور ایسی رحمت خاص عطا فرما جس سے میں دنیا و آخرت میں تیری طرف سے عزت وشرف حاصل کرسکوں۔ "
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 7,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْفَوْزَ عِنْدَ اللِّقَاءِ، وَمَنْزِلَ الشُّهَدَاءِ، وَعَيْشَ السُّعَدَاءِ، وَمُرَافَقَةَ الْأَنْبِيَاءِ، وَالنَّصْرَ عَلَى الْأَعْدَاءِ. ",
        "translations": {
          "en": "O Allah, I ask You for success at the time of meeting (You), the station of the martyrs, the life of the blessed, the companionship of the Prophets, and victory over enemies.",
          "ur": "اے اللہ میں تجھ سے مانگتا ہوں ملاقات کے وقت کامیابی، اور شہداء کرام کا سا ٹھکانہ، نیک بختوں جیسی زندگی اور انبیاء کی رفاقت و صحبت اور دشمنوں پر فتح ۔ "
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 8,
        "arabic": "اللَّهُمَّ أَنْزَلْتُ بِكَ حَاجَتِي، وَإِنَّ قَصَّرَ رَأْيِي وَضَعُفَ عَمَلِي، وَافْتَقَرْتُ إِلَى رَحْمَتِكَ، فَأَسْأَلُكَ يَا قَاضِيَ الْأُمُورِ وَيَا شَافِيَ الصُّدُورِ كَمَا تُجِيرُ بَيْنَ الْبُحُورِ أَنْ تُجِيرَنِي مِنْ عَذَابِ السَّعِيرِ، وَمِنْ دَعْوَةِ الثُّبُورِ، وَمِنْ فِتْنَةِ الْقُبُورِ، اللَّهُمَّ مَا قَصُرَ عَنْهُ رَأْيِي وَضَعُفَ مِنْهُ عَمَلِي وَلَمْ تَبْلُغْهُ أُمْنِيَّتِي مِنْ خَيْرٍ وَعَدْتَهُ أَحَدًا مِنْ عِبَادِكَ أَوْ خَيْرًا أَنْتَ مُعْطِيهِ أَحَدًا مِنْ خَلْقِكَ فَإِنِّي أَرْغَبُ إِلَيْكَ فِيهِ وَأَسْأَلُكَ يَا رَبَّ الْعَالَمِينَ.",
        "translations": {
          "en": "O Allah, I present my need before You. My understanding is limited and my actions are weak, but I am in need of Your mercy. O You who complete all matters, O You who heal the hearts! Just as You rescue between the seas, rescue me from the punishment of Hell, from the cries of Hell, and protect me from the trials of the grave. O Allah, whatever good there is that my understanding falls short of reaching and my actions are weak to attain, and my desires cannot reach it, and You have promised it to any of Your servants or You give that good to any of Your creation, then I also express my desire for it and ask You for it, O Lord of all the worlds.",
          "ur": "اے اللہ میں اپنی ضرورت تیرے سامنے پیش کرتا ہوں، میری عقل و رائے کوتاہ اور عمل کمزور ہے مگر میں تیری رحمت کا محتاج ہوں۔ تو اے کاموں کو پورا کرنے والے، سینوں کو شفا بخشنے والے! جس طرح تو سمندر کے درمیان (ڈوبنے سے) بچاتا ہے، اسی طرح تو مجھے جہنم کے عذاب سے اور جہنم کی چیخ و پکار سے بچالے اور قبر کے فتنوں سے میری حفاظت فرما۔ اے اللہ جو بھلائی بھی ایسی ہو کہ اس تک پہنچنے سے میری سمجھ قاصر اور میر اعمل کمزور ہو۔ اور میری تمنا کی پہنچ وہاں تک نہ ہو، اور تو نے اپنے بندوں میں سے کسی سے بھی اس کا وعدہ کیا ہو، یا اپنی مخلوق میں سے کسی کو بھی وہ بھلائی عطا کرنے والا ہو تو میں بھی تجھ سے اُسکی خواہش کا اظہار کرتا اور سوال کرتا ہوں، اے تمام کائنات کے پالنہار"
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 9,
        "arabic": "اللَّهُمَّ اجْعَلْنَا هَادِينَ مَهْدِيِّينَ غَيْرَ ضَالِّينَ وَلَا مُضِلِّينَ، حَرْبًا لِأَعْدَائِكَ وَسِلْمًا لِأَوْلِيَائِكَ، نُحِبُّ بِحُبِّكَ النَّاسَ، وَنُعَادِي بِعَدَاوَتِكَ مَنْ خَالَفَكَ مِنْ خَلْقِكَ. اللَّهُمَّ هَذَا الدُّعَاءُ وَعَلَيْكَ الْإِجَابَةُ، اللَّهُمَّ وَهَذَا الْجَهْدُ وَعَلَيْكَ التُّكْلَانُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ.",
        "translations": {
          "en": "O Allah, make us guides and rightly guided, not astray or leading others astray. Make us enemies to Your enemies and friends to Your friends. Let us love people for Your love, and let us be enemies to whoever opposes You from Your creation. O Allah, this is our supplication and answering it is Your task. This is our effort, but trust and reliance is only upon You. There is no power or strength except with Allah.",
          "ur": "اے اللہ تو ہمیں ہادی ومہدی بنادے، گمراہ ہونے اور کرنے والا نہ بنا،ہمیں خدا کے دشمنوں کادشمن اوراُس کے دوستوں کادوست بنا، ہم لوگوں سے تیری محبت ورضا کی خاطر ہی محبت کریں اورتیری مخلوق میں سے سے جس نے تیری مخالفت کی ہم اُس سے تیری خاطر بیر رکھیں۔ اے اللہ! یہ ہماری دعا ہے اور قبول کرنا تیرا کام۔ یہ ہماری محنت و کوشش ہے ، مگر بھروسہ و توکل تو تیرے ہی اوپر ہے۔ کوئی طاقت وقوت والا نہیں سوائے اللہ کے۔"
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 10,
        "arabic": "اللَّهُمَّ ذَا الْحَبْلِ الشَّدِيدِ وَالْأَمْرِ الرَّشِيدِ أَسْأَلُكَ الْأَمْنَ يَوْمَ الْوَعِيدِ، وَالْجَنَّةَ يَوْمَ الْخُلُودِ مَعَ الْمُقَرَّبِينَ الشُّهُودِ وَالرُّكَّعِ السُّجُودِ وَالْمُوفِينَ بِالْعُهُودِ إِنَّكَ رَحِيمٌ وَدُودٌ، وَإِنَّكَ تَفْعَلُ مَا تُرِيدُ. سُبْحَانَ الَّذِي تَعَطَّفَ بِالْعِزِّ وَقَالَ بِهِ، سُبْحَانَ الَّذِي لَا يَنْبَغِي التَّسْبِيحُ إِلَّا لَهُ، سُبْحَانَ ذِي الْعِزِّ وَالْبَهَاءِ، سُبْحَانَ ذِي الْقُدْرَةِ وَالْكَرَمِ، سُبْحَانَ الَّذِي أَحْصَى كُلَّ شَيْءٍ بِعِلْمِهَِ.",
        "translations": {
          "en": "O Allah, O Possessor of strong power and sound command! I ask You for safety on the Day of Threat (Resurrection) and Paradise on the Day of Eternity, with Your close angels who are present, and Your worshippers who bow and prostrate frequently, and those who fulfill their covenants. You are Most Merciful and Loving. Indeed, You can do whatever You will. Glory be to the One who adorned Himself with honor and spoke with it. Glory be to the One to whom alone belongs praise. Glory be to the Possessor of honor and majesty. Glory be to the Possessor of power and generosity. Glory be to the One who has counted everything with His knowledge.",
          "ur": "اے اللہ، اے مضبوط طاقت والے، اے صحیح راہ دکھانے والے! میں تجھ سے سوالی ہوں وعید کے دن (حشر) کے امن کا اورہمیشہ کی جنت کا، تیرے حاضر باش مقرب فرشتوں کے ساتھ، اور تیرے عبادت گزار، کثرت سے رکوع و سجدہ کرنے والے اوراپنے عہدوں کو پورا کرنے والے نیک بندوں کے ساتھ۔ تو تو بڑا ہی مہربان اور محبت و شفقت فرمانے والا ہے، بے شک تو جو کچھ چاہے کرسکتا ہے۔ پاک ہے وہ ذات والا جس نے عزت کا جامہ پہنا اور عزت کے کلمات ارشاد فرمائے، پاک ہے وہ ذات جس کے علاوہ کوئی تسبیح و تحمید کے لائق نہیں،پاک ہے غلبہ وشان کا مالک، پاک ہے وہ جو بہت قدرت وکرم والا ہے۔ پاک ہے وہ جو تمام اشیاء کا علم رکھتا ہے۔"
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 11,
        "arabic": "اللَّهُمَّ اجْعَلْ لِي نُورًا فِي قَلْبِي، وَنُورًا فِي قَبْرِي، وَنُورًا فِي سَمْعِي، وَنُورًا فِي بَصَرِي، وَنُورًا فِي شَعْرِي، وَنُورًا فِي بَشَرِي، وَنُورًا فِي لَحْمِي، وَنُورًا فِي دَمِي، وَنُورًا فِي عِظَامِي، وَنُورًا بَيْنَ يَدَيَّ، وَنُورًا مِنْ خَلْفِي: وَنُورًا عَنْ يَمِينِي، وَنُورًا عَنْ شِمَالِي، وَنُورًا مِنْ فَوْقِي، وَنُورًا مِنْ تَحْتِي، اللَّهُمَّ زِدْنِي نُورًا، وَأَعْظِمْ لِي نُورًا، وَاجْعَلْ لِي نُورًا",
        "translations": {
          "en": "O Allah, place light in my heart, light in my grave, light in my hearing, light in my sight, light in my hair, light in my skin, light in my flesh, light in my blood, and light in my bones. Place light before me, light behind me, light to my right, light to my left, light above me, and light below me. O Allah, grant me light, increase my light, and make me entirely light.",
          "ur": "اے اللہ! میرے دل میں نور پیدا کردے، اور میری قبر میں نور پیدا کردے، میری سماعت میں نور پیدا کردے، میری بصارت میں نور پیدا کردے، میرے بالوں میں نور پیدا کردے، میری کھال میں، میرے گوشت، میرے خون اور میری ہڈی میں نور پیدا کردے۔ میرے آگے، میرے پیچھے، میرے دائیں اور میرے بائیں نور کردے، میرے اوپر اور میرے نیچے نور کردے۔ اے اللہ مجھے نور ہی میں دے دے، مجھے عظیم نور عطا فرما اور مجھے سراپا نور بنادے۔"
        },
        "reference": "Du'a Al-Tabarani"
      },
      {
        "index": 12,
        "arabic": "اللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي وَانْقِطَاعِ عُمْرِي.",
        "translations": {
          "en": "O Allah, make Your provision most abundant for me in old age and at the end of my life.",
          "ur": "اے اللہ! بڑھاپے اور عمر کے آخری حصے میں مجھ پررزق اور زیادہ وسیع فرما دینا۔"
        },
        "reference": "Al-Mustadrak ala aṣ-Ṣaḥeeḥayn"
      },
      {
        "index": 13,
        "arabic": "اللَّهُمَّ زِدْنَا وَلاَ تَنْقُصْنَا، وَأَكْرِمْنَا وَلاَ تُهِنَّا، وَأَعْطِنَا وَلاَ تَحْرِمْنَا، وَآثِرْنَا وَلاَ تُؤْثِرْ عَلَيْنَا، وَأَرْضِنَا وَارْضَ عَنَّا.",
        "translations": {
          "en": "O Allah, increase us and do not decrease us. Honor us and do not humiliate us. Give to us and do not deprive us. Prefer us and do not prefer anyone over us. Make us pleased and be pleased with us.",
          "ur": "اے اللہ تو ہمارے لیے نعمتوں میں زیادتی فرما، کمی نہ کر۔ ہم کو عزتوں سے نواز، ذلیل نہ کر۔ ہم کو عطا فرما، محروم نہ رکھ۔ ہم کو ترجیح دے اور ہمارے اوپر کسی کو ترجیح نہ دے۔ اور ہم کو خوش رکھ اور تو خودہم سے راضی ہوجا۔"
        },
        "reference": "Sunan al-Tirmidhi"
      },
      {
        "index": 14,
        "arabic": "اللَّهُمَّ لَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَلَا تَنْزِعْ مِنِّي صَالِحَ مَا أَعْطَيْتَنِي.",
        "translations": {
          "en": "O Allah, do not leave me to myself even for the blink of an eye, and do not take away from me the good that You have given me.",
          "ur": "اے اللہ تومیرے معاملے کو پلک جھپکنے کے بقدر بھی میرے نفس کے حوالے نہ کر، اور جن اچھی نعمتوں سے تو نے مجھے نوازا ہے ان کو مجھ سے نہ چھین۔"
        },
        "reference": "Rawāhu al-Bazzāru"
      },
      {
        "index": 15,
        "arabic": "اللَّهُمَّ قِنِي شَرَّ نَفْسِي، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي",
        "translations": {
          "en": "O Allah, protect me from the evil of my soul and grant me determination and strength to choose the most guided path.",
          "ur": "اے اللہ میرے نفس کی شرارت سے میری حفاظت فرما اور صحیح راستہ اختیار کرنے کا عزم و قوت عطا فرما۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 16,
        "arabic": "اللَّهُمَّ أَقْبِلْ بِقَلْبِي عَلَى دِينِكَ، وَاحْفَظْ مِنْ وَرَائَنَا بِرَحْمَتِكَ.",
        "translations": {
          "en": "O Allah, turn my heart towards Your religion, and protect those behind us through Your special mercy.",
          "ur": "اے اللہ میرے دل کو اپنے دین کی طرف متوجہ کردے، اور اپنی خاص رحمت کے ذریعہ ہمارے پچھلے لوگوںکی حفاظت فرما۔"
        },
        "reference": "Musnad Abū Yaʿlā"
      },
      {
        "index": 17,
        "arabic": "اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ، وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ.",
        "translations": {
          "en": "O Allah, make the last part of my life the best part. Make my final deeds the best of my deeds, and make the best of my days the day I meet You.",
          "ur": "اے اللہ میری عمرکے آخری حصہ کو بہترین حصہ بنادے۔ میرے آخری عمل کو میرا بہترین عمل بنادے، اور میرا سب سے بہتر دن وہ ہو، جس دن میں تیرے سامنے حاضر ہوں۔"
        },
        "reference": "Muṣannaf Ibn Abī Shaybah"
      },
      {
        "index": 18,
        "arabic": "اللَّهُمَّ إِنِّي ضَعِيفٌ فَقَوِّ فِي رِضَاكَ ضَعْفِي، وَخُذْ إلى الْخَيْرِ بِنَاصِيَتِي، وَاجْعَلِ الْإِسْلَامَ مُنْتَهَى رِضَائِي، وَإِنِّي ذَلِيلٌ فَأَعِزَّنِي، وَإِنِّي فَقِيرٌ فَارْزُقْنِي.", 
        "translations": {
          "en": "O Allah, I am weak and powerless, so transform my weakness into strength in the works that please You, and draw me towards good, and make Islam the utmost of my desires. O Allah, I am weak and feeble, so grant me strength. I am weak, so grant me power. I am poor, so make me self-sufficient. By Your mercy, O Most Merciful of the merciful.",
          "ur": "اے اللہ میں کمزور وناتواں ہوں لہٰذا اپنی رضا کے کاموں میں میری کمزوری کو قوت سے بدل دے، اور مجھے خیر کی طرف کھینچ لا، اور اسلام کو میری انتہائی پسند بنادے۔اے اللہ میں کمزور وضعیف ہوں تو مجھ کو قوت عطا فرما، میں کمزور ہوں تو مجھے طاقت عطا فرما، میں فقیر ہوں، مجھے بے نیاز بنا۔ تیری رحمت کا واسطہ ہے، اے ارحم الراحمین۔"
        },
        "reference": "Rawāhu al-Ḥākim"
      },
      {
        "index": 19,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً نَقِيَّةً، وَمِيتَةً سَوِيَّةً، وَمَرَدًّا غَيْرَ مُخْزٍ وَلَا فَاضِحٍ",
        "translations": {
          "en": "O Allah, I ask You for a pure life and a proper death, and for an end that is neither disgraceful nor shameful.",
          "ur": "اے اللہ میں سوال کرتا ہوں تجھ سے پاکیزہ زندگی کا اور ڈھنگ کی موت کا۔ اور ایسے انجام کا جس میں نہ ذلت و رسوائی ہو اور نہ فضیحت ہو۔"
        },
        "reference": "Rawāhu at-Tabarāni wal-Bazzāru"
      },
      {
        "index": 20,
        "arabic": "اللهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ الْأَشْيَاءِ إِلَيَّ وَاجْعَلْ خَوْفَكَ أَخْوَفَ الْأَشْيَاءِ عِنْدِي وَاقْطَعْ عَنِّي حَاجَاتِ الدُّنْيَا بِالشَّوْقِ إِلَى لِقَائِكَ وَإِذَا أَقْرَرْتَ أَعْيُنَ أَهْلِ الدُّنْيَا مِنْ دُنْيَاهُمْ فَأَقِرَّ عَيْنِي مِنْ عِبَادَتِكَ.",
        "translations": {
          "en": "O Allah, make Your love the most beloved of all things to me, and make Your fear the most fearful of all things to me. Make me so desirous of meeting You that the needs of this world fall away from me. And just as You have cooled the eyes of the people of the world with their world, cool my eyes with Your worship.",
          "ur": "اے اللہ! میرے دل میں اپنی محبت کو ساری محبتوں پر غالب فرما۔ اور اپنا خوف سارے ڈروں پر غالب فرما۔اور مجھے اپنی ملاقات کا ایسا مشتاق بنا دے کہ دنیا کی ضرورتوں سے میرا پیچھا چھوٹ جائے۔اور جب تو نے دنیا والوں کی آنکھیں ان کی دنیا سے ٹھنڈی کی ہیں تو میری آنکھیں اپنی عبادت سے ٹھنڈی فرما۔"
        },
        "reference": "Ḥilyat al-Awliyā"
      },
      {
        "index": 21,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهُمَا إِلَّا أَنْتَ.",
        "translations": {
          "en": "O Allah, I ask You for Your bounty of worldly blessings and Your mercy of religious rewards, for none owns these except You.",
          "ur": "اے اللہ! میں تجھ ہی سے دنیوی نعمتوں کا فضل اور دینی انعامات کی رحمت مانگتا ہوں، اس لیے کہ ان دونوں کا مالک صرف تو ہی ہے۔"
        },
        "reference": "Al-Muʿjam al-Kabīr"
      },
      {
        "index": 22,
        "arabic": "اللَّهُمَّ افْتَحْ مَسَامِعَ قَلْبِي لِذِكْرِكَ، وَارْزُقْنِي طَاعَتَكَ وَطَاعَةَ رَسُولِكَ، وَعَمَلًا بِكِتَابِكَ.",
        "translations": {
          "en": "O Allah, open the channels of my heart for Your remembrance, and grant me success in obeying You and Your Messenger, and in acting upon Your Book.",
          "ur": "اے اللہ! میرے دل کے دریچوں کو اپنے ذکر کے لیے کھول دے، اور مجھے اپنی اور اپنے رسول کی طاعت و فرما نبرداری اور اپنی کتاب پر عمل کرنے کی توفیق نصیب فرما۔"
        },
        "reference": "Al-Du'a li'l-Tabarānī"
      },
      {
        "index": 23,
        "arabic": "اللهُمَّ إِنِّي أَسْأَلُكَ التَّوْفِيقَ لِمَحَابِّكَ مِنَ الْأَعْمَالِ، وَصِدْقَ التَّوَكُّلِ عَلَيْكَ وَحُسْنَ الظَّنِّ بِكَ.",
        "translations": {
          "en": "O Allah, I ask You for success in doing what You love, for sincere trust and reliance upon You, and I ask You to always have good thoughts of You.",
          "ur": "اے اللہ! میں تجھ سے تیری مرضیات پر عمل کی توفیق مانگتا ہوں، تیرے اوپر سچا توکل و بھروسہ مانگتا ہوں، اور تجھ سے ہمیشہ حسن ظن رکھنے کا سوال کرتا ہوں۔"
        },
        "reference": "Ḥilyat al-Awliyā"
      }
    ],
    "saturday": [
      {
        "index": 1,
        "arabic": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي خَطَئِي وَعَمْدِي، اللَّهُمَّ إِنِّي أَسْتَهْدِيكَ لِأَرْشَدِ أَمْرِي، وَأَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي",
        "translations": {
          "en": "O Allah, forgive my sins, both those committed in error and those committed intentionally. O Allah, guide me to the most guided of matters, and I seek refuge in You from the evil of my soul.",
          "ur": "اے اللہ! تو میرے گناہوں کو معاف فرما، غلطی سے ہوجانے والے گناہوں کو بھی اور قصداً کئے جانے والے گناہوں کو بھی۔ اے اللہ مجھے سب سے صحیح راستے پر چلا،اور میں تیری پناہ مانگتا ہوں اپنے نفس کے شر سے ۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 2,
        "arabic": "اللَّهُمَّ أَعِنِّي عَلَى دِيْنِيْ بِالدُّنْيَا وَعَلَى آخِرَتِي بِالتَّقْوَى وَاحْفَظْنِي فِيمَا غِبْتُ عَنْهُ وَلَا تَكِلْنِي إِلَيَّ فِيْمَا حَضَرْتُ يَا مَنْ لَا تَضُرُّهُ الذُّنُوبُ وَلَا تَنْقُصُهُ الْمَغْفِرَة. هَبْ لِي مَا لَا يَنْقُصُكَ وَاغْفِرْ لِي مَا لَا يَضُرّك.",
        "translations": {
          "en": "O Allah, help me with my religion through this world, and help me with my Hereafter through piety. Protect me in what I am absent from, and do not leave me to myself in what I am present in. O You whom sins do not harm and forgiveness does not decrease. Grant me what does not decrease You, and forgive me what does not harm You.",
          "ur": "اے اللہ! مجھے اتنی دنیا عطا فرما جس سے مجھے دین میں مدد ملے، اور مجھے اپنا ایسا خوف دے جس سے میری آخرت سنور جائے، اور میری نظر سے دور رہنے والی چیزوں کی حفاظت فرما، اور نظر کے سامنے کی چیزوں میں بھی میرا معاملہ میرے حوالے نہ فرما۔ اے وہ بلند ذات جس کا نہ گناہ کچھ بگاڑ سکتے ہیں اور نہ مغفرت کی اس کے خزانے میں کمی ہے۔سو تو مجھے وہ مغفرت دے دے جس کی تیرے خزانے میں کوئی کمی نہیں، اوران گناہوں کو نظر انداز کر دے جن سے تیرا کچھ نقصان نہیں ہوتا۔"
        },
        "reference": "Ibn Asakir"
      },
      {
        "index": 3,
        "arabic": "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ.",
        "translations": {
          "en": "O Allah, I seek refuge in You from the evil of what I have done and from the evil of what I have not done.",
          "ur": "اے اللہ! میں اپنے کردہ وناکردہ گناہوں کے شر سے آپ کی پناہ مانگتا ہوں۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 4,
        "arabic": "اللَّهُمَّ اجْعَلْنِي أُعَظِّمُ شُكْرَكَ، وَأُكْثِرُ ذِكْرَكَ، وَأَتَّبِعُ نَصِيحَتَكَ، وَأَحْفَظُ وَصِيَّتَكَ.",
        "translations": {
          "en": "O Allah, make me greatly grateful to You, make me remember You frequently, make me follow Your advice, and make me preserve Your covenant.",
          "ur": "یا اللہ! مجھے ایسا بنادے کہ میں تیرا بڑا شکر ادا کیا کروں اور تیرا بہت کثرت سے ذکر کرتا رہوں اور تیری نصیحتوں کی پیروی کرتا رہوں اور تیرے تاکیدی احکام کو یاد رکھا کروں۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 5,
        "arabic": "اللَّهُمَّ أعطني إِيمَانًا يُبَاشِرُ قَلْبِي حَتَّى أَعْلَمَ أَلا يُصِيبَنِي إلاَّ مَا كَتَبْتَ لِي وَرِضًا مِنَ الْمَعِيشَةِ بِمَا قَسَمْتَ لِي.",
        "translations": {
          "en": "O Allah, grant me faith that touches my heart until I know that nothing will befall me except what You have written for me, and contentment with the livelihood that You have apportioned for me.",
          "ur": "اے اللہ! مجھے ایسا ایمان عطا فرمادیجیے جو میرے دل میں اترجائے اور پھر میرا یہ یقین ہوجائے کہ مجھے بس وہی مل سکتا ہے جوآپ میرے لیے لکھ چکے ہیں۔ اور مجھے اطمینان وقناعت عطافرمادیجیے اتنے زندگی کے سامان پر جتناآپ نے میری قسمت میں لکھ دیا ہے۔"
        },
        "reference": "Musnad Al-Bazzar"
      },
      {
        "index": 6,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا لَا يَرْتَدُّ، وَنَعِيمًا لَا يَنْفَدُ، وَمُرَافَقَةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَعْلَى جُنَّةِ الْخُلْدِ.",
        "translations": {
          "en": "O Allah, I ask You for faith that does not turn back, blessings that do not end, and the companionship of Muhammad (peace be upon him) in the highest gardens of eternity.",
          "ur": "اے اللہ! میں آپ سے نہ پھِرنے والا ایمان، ہمیشہ کی نعمتیں اور جنت کے اعلیٰ مقام میں اپنے نبی جناب محمد صلی اللہ علیہ وسلم کا ساتھ طلب کرتا ہوں۔"
        },
        "reference": "Sahih Ibn Hibban"
      },
      {
        "index": 7,
        "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ، وَإِلَيْكَ الْمُشْتَكَى، وَأَنْتَ الْمُسْتَعَانُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيم",
        "translations": {
          "en": "O Allah, all praise is for You, and to You is the complaint. You are the One from whom help is sought. There is no power or strength except with Allah, the Most High, the Most Great.",
          "ur": "اے اللہ! ساری تعریف آپ کے لیے ہے، اور (اپنی تکلیف کی) شکایت بھی آپ سے ہی ہے۔میں آپ ہی سے مدد طلب کرتا ہوں۔ نہیں ہے کوئی طاقت اور قوت مگر اللہ تعالیٰ ہی کی مدد سے۔"
        },
        "reference": "Al-Mu'jam Al-Awsat"
      },
      {
        "index": 8,
        "arabic": "اللّهُمَّ إِنَّكَ تَسْمَعُ كَلَامِي، وَتَرَى مَكَانِي، وَتَعْلَمُ سِرِّي وعلانيتِي، لَا يَخْفَى عَلَيْكَ شَيْءٌ مِنْ أَمْرِي، وَأَنَا الْبَائِسُ الْفَقِير، الْمُسْتَغِيثُ الْمُسْتَجِير، وَالْوَجِلُ الْمُشْفِقُ الْمُقِرُّ الْمُعْتَرِفُ بِذَنَبِهِ، أَسْأَلُكَ مَسْأَلَةَ الْمستكينِ وَأَبْتَهِلُ إِلَيْكَ ابْتِهَالَ الْمُذْنِبِ الذَّلِيلِ، وَأَدْعُوكَ دُعَاءَ الْخَائِفِ الضَّرِيرِ، دُعَاءَ مَنْ خَضَعَتْ لَكَ رَقَبَتُهُ وَفَاضَتْ لَكَ عَيْنَاهُ وذلَّ جَسَدُهُ وَرَغِمَ لك أَنْفُهُ، اللّهُمَّ لَا تَجْعَلْنِي بدُعائِكَ شَقِيًّا، وَكُنْ بِي رَؤُوْفًا رَحِيمًا، يَا خَيْرَ الْمَسْئُولينَ وَيَا خَيْرَ الْمُعْطِينَ.",
        "translations": {
          "en": "O Allah, You hear my words, You see my place, and You know my secret and my public. Nothing of my affair is hidden from You. I am the miserable, the poor, the one seeking help, the one seeking refuge, the fearful, the anxious, the one who acknowledges and confesses his sin. I ask You with the request of the humble, I beseech You with the beseeching of the sinful and lowly, I call upon You with the call of the fearful and distressed, the call of one whose neck has submitted to You, whose eyes have overflowed for You, whose body has humbled itself to You, and whose nose has been rubbed in the dust for You. O Allah, do not make me wretched by my supplication to You, and be kind and merciful to me. O Best of those who are asked, O Best of those who give.",
          "ur": "اے اللہ آپ میری بات سن رہے ہیں، میں جہاں اور جس حال میں ہوں آپ اسے دیکھتے ہیں۔ آپ میرے ظاہر وباطن سے باخبر ہیں۔ میری کوئی بات آپ سے مخفی نہیں، میں دُکھی ہوں، محتاج ہوں، فریادی اور پناہ جو ہوں، ترساں وہراساں ہوں، اپنے گناہوں کااقراری ہوں،آپ سے ایک بے کس کی طرح سوال کرتا ہوں اورآپ کے آگے ایک گنہگارو ذلیل بندہ کی طرح گڑگڑاتا ہوں، اور خوف زدہ آفت رسیدہ شخص کی طرح آپ کو پکارتا ہوں، اس شخص کی طرح دعا مانگتا ہوں جس کی گردن آپ کے سامنے جھکی ہوئی ہو اور اس کے آنسو بہہ رہے ہوں، تن بدن سے آپ کے سامنے فروتنی کیے ہوئے ہو اور اپنی ناک آپ کے سامنے رگڑ رہا ہو۔ اے اللہ مجھے اس دعا مانگنے میں محروم نہ رکھیو، اور میرے حق میں بڑے مہربان ونہایت رحیم ہوجائیو۔ اے سب سے بہتر وبرتر جن سے مانگنے والے مانگتے ہیں اور جو مانگنے والوں کو دیتے ہیں۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 9,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَالعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ، اللَّهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ إِلَيَّ مِنْ نَفْسِي وَأَهْلِي، وَمِنَ المَاءِ البَارِدِ.",
        "translations": {
          "en": "O Allah, I ask You for Your love, and the love of those who love You, and for actions that will bring me to Your love. O Allah, make Your love more beloved to me than myself, my family, and cold water.",
          "ur": "اے اللہ! میں آپ سے مانگتا ہوں آپ کی محبت،آپ سے محبت رکھنے والے بندوں کی محبت ، اورآپ سے ایسے اعمال کی توفیق کاسوال کرتا ہوں جو مجھے آپ کا محبوب بنا دیں۔ اے اللہ! اپنی محبت کو میرے لیے اپنی جان،اہل وعیال اور ٹھنڈے پانی سے بھی زیادہ محبوب بنادے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 10,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ كُلِّ عَمَلٍ يُخْزِينِي، وَأَعُوذُ بِكَ مِنْ صَاحِبٍ يُرْدِينِي، وَأَعُوذُ بِكَ مِنْ كُلِّ أَمَلٍ يُلْهِينِي، وَأَعُوذُ بِكَ مِنْ كُلِّ فَقْرٍ يُنْسِينِي، وَأَعُوذُ بِكَ مِنْ كُلِّ غِنًى يُطْغِينِي.",
        "translations": {
          "en": "O Allah, I seek refuge in You from every deed that will disgrace me, from every companion who will ruin me, from every hope that will distract me, from every poverty that will make me forget, and from every wealth that will make me transgress.",
          "ur": "اے اللہ! میں تیری پناہ چاہتا ہوں ہر ایسے عمل سے جو مجھے رسوا کردے اورایسے ساتھی سے جو مجھے برباد کردے، اور ہر ایسی خواہش وتمنا سے جو مجھے ہلاک کردے، اور ایسی غربت سے جو ہوش نہ چھوڑے، اور ایسی دولت سے جو سرکش بنادے۔"
        },
        "reference": "Rawah Al-Bazzar"
      },
      {
        "index": 11,
        "arabic": "اللّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ، وَالْكَسَلِ، وَالْجُبْنِ، وَالْبُخْلِ، وَالْهَرَمِ، وَعَذَابِ الْقَبْرِ. اللهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا.",
        "translations": {
          "en": "O Allah, I seek refuge in You from helplessness, laziness, cowardice, miserliness, old age, and the punishment of the grave. O Allah, grant my soul its piety and purify it, for You are the best to purify it. You are its Guardian and Master. O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not fear, from a soul that is not satisfied, and from a supplication that is not answered.",
          "ur": "اے اللہ میں آپ کی پناہ مانگتا ہوںلاچارگی، سستی، بزدلی، بخل، برے بڑھاپے اور عذاب قبر سے۔ اے اللہ میرے نفس کو تقویٰ کی دولت نصیب فرمائیے اور اس کا تزکیہ فرما دیجیے (پاک صاف کردیجیے)۔ آپ نفوس کا بہترین تزکیہ کرنے والے ہیں۔آپ ہی میرے نفس کے مالک و آقا ہیں۔ اے اللہ! آپ کی پناہ ایسے علم سے جو نفع نہ دے اور ایسے دل سے جس میں آپ کا ڈر نہ ہو، اور ایسے پیٹ سے جو نہ بھرے، اور ایسی دعا سے جو قبول نہ ہو۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 12,
        "arabic": "اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَأَنْتَ الْمُسْتَعَانُ، وَعَلَيْكَ البَلاَغُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ.",
        "translations": {
          "en": "O Allah, we ask You for all the good that Your Prophet Muhammad (peace be upon him) asked You for, and we seek refuge in You from all the evil from which Your Prophet Muhammad (peace be upon him) sought refuge. You are the One from whom help is sought, and upon You is the responsibility. There is no power or strength except with Allah.",
          "ur": "اے اللہ ہم تجھ سے ان ساری بھلائیوں کا سوال کرتے ہیں جو تیرے نبی جناب محمد صلی اللہ علیہ وسلم نے تجھ سے مانگی ہیں اور ان تمام چیزوں کے شر سے ہم تیری پناہ چاہتے ہیں جن سے تیرے نبی نے پناہ مانگی ہے۔ تجھ ہی سے مدد کا سوال ہے اور تیری ہی مدد سے کام بنتا ہے۔ نہیں ہے کوئی زور اور طاقت کسی میں سوائے اللہ تعالیٰ کے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 13,
        "arabic": "اللَّهُمَّ أَصْلِحْ ذَاتَ بَيْنِنَا، وَأَلِّفْ بَيْنَ قُلُوبِنَا، وَاهْدِنَا سُبُلَ السَّلَامِ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ، وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ. اللَّهُمَّ بَارِكْ لَنَا فِي أَسْمَاعِنَا وَفِي أَبْصَارِنَا، وَقُلُوبِنَا وَأَزْوَاجِنَا، وَذُرِّيَّاتِنَا، وَتُبْ عَلَيْنَا، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ، وَاجْعَلْنَا شَاكِرِينَ لِنِعَمِكَ مُثْنِينَ بِهَا، قَابِلِينَ لَهَا، وَأَتِمَّهَا عَلَيْنَا.",
        "translations": {
          "en": "O Allah, reconcile between us, unite our hearts, guide us to the paths of peace, and save us from darkness to light. Keep us away from indecencies, both apparent and hidden. O Allah, bless us in our hearing, our sight, our hearts, our spouses, and our children. Accept our repentance. You are the Accepter of Repentance, the Most Merciful. Make us grateful for Your blessings, praising You for them, accepting them, and complete them for us.",
          "ur": "اے اللہ ہمارے آپس کے معاملات درست کردیجیے، ہمارے دلوں میں الفت ومحبت پیدا فرما دیجیے۔ چلا دیجیے ہم کو سلامتی وہدایت کا راستہ اور نکال لیجیے ہم کو تاریکیوں سے روشنی میں۔ ہمیں کھُلی اور چھُپی دونوں قسم کی بے حیائیوں سے دور رکھیے۔ اے اللہ! برکت دے دیجیے ہمارے کانوں، آنکھوں اور دلوں میں، ہماری بیویوں اور اولاد میں، ہماری توبہ قبول فرمائیے۔ آپ بہت ہی توبہ قبول کرنے واے اور بے حد رحم کرنے والے ہیں۔ خدایا!ہم کو اپنی نعمتوں کا قدرداں، ان پر آپ کا ثنا خواں اور شکر کے ساتھ ان کو قبول کرنے والابنائیے، اورہم پرکامل ومکمل نعمتیں نازل فرمائیے۔"
        },
        "reference": "Mu'jam Al-Tabarani"
      },
      {
        "index": 14,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِي وَتَرْحَمَنِي، وَإِذَا أَرَدْتَ بِقَوْمٍ فِتْنَةً فَتَوَفَّنِي إِلَيْكَ، وَأَنَا غَيْرُ مَفْتُونٍ، اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَحُبًّا يُبَلِّغُنِي حُبَّكَ.",
        "translations": {
          "en": "O Allah, grant me success in doing good deeds, abandoning evil deeds, and loving the poor. And I ask You to forgive me and have mercy on me. And when You decide to put a people to trial, then take me to You without being put to trial. O Allah, I ask You for Your love, and the love of those who love You, and for love that will bring me to Your love.",
          "ur": "اے اللہ! مجھے توفیق عنایت فرما نیکیوںکی، برائیاں چھوڑنے کی، اور غریبوں سے محبت کی۔اور میں اس کا بھی سوالی ہوں کہ تو میری مغفرت فرما اورمجھ پر رحم فرما۔ اور جب تو کسی قوم کو فتنے اور آزمائش میں ڈالنے کا فیصلہ فرمائے تو مجھے اس فتنے سے بچا کر اپنے پاس بلا لینا۔ اے اللہ میں مانگتا ہوں تجھ سے ان بندوں کی محبت جو تجھ سے محبت رکھتے ہیں اور ایسی محبت کا جو مجھے تیرا محبوب بنا دے۔"
        },
        "reference": "Al-Mustadrak"
      }
    ],
    "sunday": [
      {
        "index": 1,
        "arabic": "اللَّهُمَّ أَنْتَ الْأَوَّلُ لَا شَيْءَ قَبْلَكَ، وَأَنْتَ الْآخِرُ لَا شَيْءَ بَعْدَكَ، اللَّهُمَّ أَعُوذُ بِكَ مِنْ كُلِّ دَابَّةٍ نَاصِيَتُهَا بِيَدِكَ، وَأَعُوذُ بِكَ مِنَ الْإِثْمِ وَالْكَسَلِ، وَمِنْ عَذَابِ النَّارِ وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْغِنَى وَمِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ، اللَّهُمَّ نَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، اللَّهُمَّ بَعِّدْ بَيْنِي وَبَيْنَ خَطِيئَتِي كَمَا بَعَّدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، هَذَا مَا سَأَلَ مُحَمَّدٌ رَبَّهُ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَسْأَلَةِ، وَخَيْرَ الدُّعَاءِ، وَخَيْرَ النَّجَاحِ، وَخَيْرَ الْعَمَلِ، وَخَيْرَ الثَّوَابِ، وَخَيْرَ الْحَيَاةِ، وَخَيْرَ الْمَمَاتِ، وَثَبِّتْنِي وَثَقِّلْ مَوَازِينِي، وَأَحِقَّ إِيمَانِي، وَارْفَعْ دَرَجَتِي، وَتَقَبَّلْ صَلَاتِي، وَاغْفِرْ خَطِيئَتِي، وَأَسْأَلُكَ الدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ، آمِين.",
        "translations": {
          "en": "O Allah, You are the First, there is nothing before You, and You are the Last, there is nothing after You. O Allah, I seek refuge in You from every creature whose forehead is in Your grasp. And I seek refuge in You from sin and laziness, from the punishment of Hell and the punishment of the grave, from the trial of wealth and the trial of poverty, and I seek refuge in You from sin and debt. O Allah, purify my heart from sins as You have purified a white garment from filth. O Allah, distance me from my sins as You have distanced the East from the West. This is what Muhammad asked of his Lord. O Allah, grant me the best of asking, the best of supplication, the best of success, the best of deeds, the best of reward, the best of life, and the best of death. Make me firm and make my scales heavy, make my faith true, raise my rank, accept my prayer, forgive my sins, and I ask You for the highest levels of Paradise. Amen.",
          "ur": "خدایا! تو ہی اول ہے تجھ سے پہلے کوئی نہیں، تو ہی آخر ہے تیرے بعد کوئی نہیں۔ یا اللہ! میں آپ کی پناہ چاہتا ہوں ہرجانور سے جس کی پیشانی آپ کے قبضہ میں ہے۔ اور میں آپ کی پناہ چاہتا ہوں تمام گناہوں سے، کاہلی سے، جہنم کے عذاب سے اور قبر کے عذاب سے۔آپ کی پناہ مالداری کے فتنہ سے اور فقروفاقہ کے فتنہ سے اور میں آپ کی پناہ لیتا ہوں گناہ سے اور قرض کے بوجھ سے۔ یا اللہ! میرے دل کو غلط کاریوں کی گندگی سے اس طرح پاک و صاف کردے جس طرح تو نے سفید کپڑے کو گندگی سے پاک و صاف کردیا ہے۔ یا اللہ میرے اور میرے گناہوں کے درمیان اتنی دوری کردے جتنی دوری تو نے مشرق و مغر ب کے درمیان کردی ہے۔ اے اللہ! یہ محمد صلی اللہ علیہ وسلم کی دعا ہے جو انہوں نے اپنے رب سے مانگی ہے۔ یا اللہ! مجھے توفیق دیجیے اچھے طریقے سے مانگنے اور اچھی دعا کی۔ میں سوالی ہوں اچھی کامیابی اوراچھے عمل کی تو فیق کا، اچھی زندگی اوراچھی موت کا۔ آپ میرے قدموں کو (دنیا میں حق پر) جمادیجیے اور(قیامت میں) اعمال کے ترازو میں میری نیکیوں کو بھاری کردیجیے گا۔ میرے ایمان کو حقیقی ایمان بنا دیجیے، میرے درجات کو بلند فرمائیے، میری نمازوں کو قبول فرمالیجیے، میرے گناہوں کو معاف کردیجیے اور میں آپ سے جنت کا اعلیٰ درجہ مانگتا ہوں۔ آمین۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 2,
        "arabic": "اللَّهُمَّ جَنِّبْنِي مُنْكَرَاتِ الْأَعْمَالِ، وَالْأَخْلَاقِ، وَالْأَهْوَاءِ، وَالْأَدْوَاءِ.",
        "translations": {
          "en": "O Allah, keep me away from evil deeds, evil morals, evil desires, and evil diseases.",
          "ur": "یا اللہ! مجھے برے اعمال سے برے اخلاق سے بری خواہشات سے اور بری بیماریوں سے بچا۔"
        },
        "reference": "Musannaf Ibn Abi Shaybah"
      },
      {
        "index": 3,
        "arabic": "اللَّهُمَّ إِنِّي ضَعِيفٌ فَقَوِّ فِي رِضَاكَ ضَعْفِي، وَخُذْ لِيَ الْخَيْرَ بِنَاصِيَتِي، وَاجْعَلِ الْإِسْلَامَ مُنْتَهَى رِضَائِي، اللَّهُمَّ إِنِّي ضَعِيفٌ فَقَوِّنِي، وَإِنِّي ذَلِيلٌ فَأَعِزَّنِي، وَإِنِّي فَقِيرٌ فَارْزُقْنِي.",
        "translations": {
          "en": "O Allah, I am weak, so strengthen me in what pleases You, take me by the forelock to good, and make Islam the utmost of my desires. O Allah, I am weak, so strengthen me. I am lowly, so honor me. I am poor, so provide for me.",
          "ur": "یا اللہ! میں کمزور ہوں،آپ اپنی رضا کے راستے میں مجھے طاقت بخش دیجیے، میری پیشانی پکڑ کر مجھے خیر میں لگادیجیے اور اسلام کو میری پوری خوشی ومسرت کا سامان بنادیجیے۔ خدایا! میں کمزور ہوں، مجھے قوت دیجیے۔ میں فقیر ومحتاج ہوں، مجھے اپنا رزق عطا فرمائیے۔"
        },
        "reference": "Al-Mustadrak"
      },
      {
        "index": 4,
        "arabic": "الّلهُمَّ اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي خُلُقِي وَطَيِّبْ لِي كَسْبِي وَقَنِّعْنِي بِما رَزَقْتَنِي، وَلا تُذْهِبْ طَلَبِي إلَى شَيْءٍ صَرَفْتَهُ عَنِّي",
        "translations": {
          "en": "O Allah, forgive my sins, expand my character, purify my earnings, and make me content with what You have provided for me. And do not make me seek that which You have turned away from me.",
          "ur": "یا اللہ! میرے گناہوں کو معاف کردیجیے، میرے اخلاق میں وسعت پیدا کردیجیے، میری کمائی پاک کردیجیے اور جوآپ نے مجھے رزق عطا کیا ہے اس پر مجھے مطمئن وقناعت کرنے والا بنادیجیے۔ اور مجھے ایسی چیز کے پیچھے پڑنے والا نہ بنائیے جو آپ نے میری قسمت میں نہیں لکھی ہے۔"
        },
        "reference": ""
      },
      {
        "index": 5,
        "arabic": "الّلهُمَّ إِنِّي أَسْأَلُكَ نَفْسًا بِكَ مُطْمَئِنَّةً، تُؤْمِنُ بِلِقَائِكَ، وَتَرْضَى بِقَضَائِكَ، وَتَقْنَعُ بِعَطَائِكَ.",
        "translations": {
          "en": "O Allah, I ask You for a soul that is content with You, that believes in meeting You, that is pleased with Your decree, and that is satisfied with Your provision.",
          "ur": "یا اللہ! میں آپ سے سوالی ہوں ایسے نفس کا جو آپ سے مطمئن اور راضی ہو، جو آپ کی ملاقات کا یقین رکھتا ہو اور جو آپ کے فیصلوں پر راضی وخوش ہو اور جو آپ کے دیے رزق پرقانع ہو۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 6,
        "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ.",
        "translations": {
          "en": "O Ever-Living, O Self-Sustaining! I seek help through Your mercy. Set right all my affairs, and do not leave me to myself even for the blink of an eye.",
          "ur": "یا حی یا قیوم!(اے وہ ذات جو ہمیشہ زندہ ہے اور جس کے دم سے سب کچھ قائم ہے!)میں تیری رحمت کی دہائی دیتا ہوں۔ میرے تمام حالات کو درست کردے اور ایک لمحہ کے لیے بھی مجھے میرے حوالے نہ فرما ۔"
        },
        "reference": "Al-Sunan Al-Kubra li'l-Nasa'i"
      },
      {
        "index": 7,
        "arabic": "اللَّهُمَّ اغْفِرْ لِي خَطَايَايَ وَذُنُوبِي كُلِّهَا، اللَّهُمَّ وَانْعَشْنِي وَاجْبُرْنِي وَاهْدِنِي لِصَالِحِ الْأَعْمَالِ وَالْأَخْلَاقِ، إِنَّهُ لَا يَهْدِي لِصَالِحِهَا وَلَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ.",
        "translations": {
          "en": "O Allah, forgive all my errors and sins. O Allah, revive me, mend me, and guide me to righteous deeds and good character. None guides to what is good of them and averts what is evil of them except You.",
          "ur": "یا اللہ! میری تمام خطاؤں اور گناہوںکو معاف کردے۔ یا اللہ! مجھے ہمت ونشاط عطا کر، میرے حال کو درست کردے اور مجھے اچھے اعمال کرنے کی اور اچھے اخلاق اپنانے کی توفیق دے۔ تو ہی اچھے اعمال کی توفیق دیتا ہے اور برے اعمال سے تو ہی بچاتا ہے۔"
        },
        "reference": "Al-Mu'jam Al-Awsat"
      },
      {
        "index": 8,
        "arabic": "أَعُوذُ بِاللَّهِ مِنْ جَهْدِ البَلاَاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ القَضَاءِ، وَشَمَاتَةِ الأَعْدَاءِ.",
        "translations": {
          "en": "I seek refuge in Allah from the hardship of trials, the occurrence of misery, bad fate, and the gloating of enemies.",
          "ur": "یااللہ! میں تیری پناہ چاہتا ہوں آزمائش کی مشقت سے، بدبختی کے انجام بد سے اور بری تقدیر سے اور د شمنوں کے ہنسنے سے۔"
        },
        "reference": "Sahih Al-Bukhari"
      },
      {
        "index": 9,
        "arabic": "اللَّهُمَّ افْتَحْ مَسَامِعَ قَلْبِي لِذِكْرِكَ، وَارْزُقْنِي طَاعَتَكَ، وَطَاعَةَ رَسُولِكَ -صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- وَعَمَلًا بِكِتَابِكَ.",
        "translations": {
          "en": "O Allah, open the channels of my heart for Your remembrance, and grant me success in obeying You and Your Messenger (peace be upon him), and in acting upon Your Book.",
          "ur": "خدایا! میرے دل کے کانوں کو اپنے ذکر کے لیے کھول دیجیے، اورمجھے توفیق دیجیے اپنی اطاعت کی اور محمد صلی اللہ علیہ وسلم کی اطاعت کی اور اپنی کتاب پر عمل کی ۔"
        },
        "reference": "Al-Mu'jam Al-Awsat"
      },
      {
        "index": 10,
        "arabic": "اللَّهُمَّ الْطُفْ بِي فِي تَيْسِيرِ كُلِّ عَسِيرٍ، فَإِنَّ تَيْسِيرَ كُلِّ عَسِيرٍ عَلَيْكَ يَسِيرٌ، وَأَسْأَلُكَ الْيُسْرَ وَالْمُعَافَاةَ فِي الدُّنْيَا وَالْآخِرَةِ.",
        "translations": {
          "en": "O Allah, be kind to me in making every difficulty easy, for making every difficulty easy is easy for You. And I ask You for ease and well-being in this world and the Hereafter.",
          "ur": "یا اللہ! مجھ پر کرم فرما ئیے اور ہر دشواری و تنگی کو آسان کردیجیے۔ یقینا ہر مشکل چیز کو آسان بناناآپ کے لیے آسان ہے اور میں آپ سے آسانی کا اور دنیا وآخرت میں عافیت کا سوال کرتا ہوں۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 11,
        "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ، وَإِلَيْكَ الْمُشْتَكَى، وَأَنْتَ الْمُسْتَعَانُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ.",
        "translations": {
          "en": "O Allah, to You belongs all praise, and to You is the complaint. You are the One from whom help is sought. There is no power or strength except with Allah, the Most High, the Most Great.",
          "ur": "یا اللہ! ہم آپ ہی کی تعریف وثنا کرتے ہیں اور (اپنی تکلیفوں کی ) شکایت بھی آپ ہی کی جناب میں پیش کرتے ہیں۔ آپ ہی سے تو مدد چاہی جاتی ہے۔نہ کسی میں زور ہے نہ طاقت سوائے اللہ بلندوبرتر عظمت والے کے۔"
        },
        "reference": "Al-Tabarani"
      },
      {
        "index": 12,
        "arabic": "اللهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرّ.",
        "translations": {
          "en": "O Allah, set right my religion which is the safeguard of my affairs, set right my world in which is my livelihood, and set right my Hereafter in which is my return. Make life for me an increase in every good, and make death for me a rest from every evil.",
          "ur": "یا اللہ! میرے دین کی اصلاح فرمادیجیے جو میری نجات کا ذریعہ ہے۔ اور میری دنیا کو بھی درست کردیجیے جس میں مجھے زندگی گزارنی ہے اور میرا انجام آخرت میں بھی اچھا کردیجیے جہاں مجھے لوٹ کر جانا ہے۔ اور (اے میرے اللہ) جب تک زندگی رہے ہر خیر میں اضافہ ہوتا رہے اور موت آئے تو شر وخرابی سے نجات کا ذریعہ بن جائے۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 13,
        "arabic": "اللَّهُمَّ ارْزُقْنِي عَيْنَيْنِ هَطَّالَتَيْنِ تَشْفِيَانِ الْقَلْبَ بِذُرُوفِ الدَّمْعِ مِنْ خَشْيَتِكَ قَبْلَ أَنْ يَكُونَ الدَّمْعُ دَمًا وَالْأَضْرَاسُ جَمْرًا.",
        "translations": {
          "en": "O Allah, grant me eyes that shed tears profusely out of fear of You, which quench the heart with tears, before the day when eyes will shed tears of blood and molars will become embers.",
          "ur": "یا اللہ! مجھے ایسی آنکھیں دے دیجئے جو آپ کے خوف سے خوب آنسو بہاتی ہوں، جوآنسودل کو سیرابی وزندگی عطا کریں۔، اس دن کے آنے سے پہلے جب آنکھیں خون کے آنسو روئیں گی اور (منہ میں) ڈاڑھیں انگارہ بنا دی جائیں گی۔"
        },
        "reference": "Hilyat"
      },
      {
        "index": 14,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي، وَمِنْ شَرِّ بَصَرِي، وَمِنْ شَرِّ لِسَانِي، وَمِنْ شَرِّ قَلْبِي، وَمِنْ شَرِّ مَنِيِّي.",
        "translations": {
          "en": "O Allah, I seek refuge in You from the evil of my hearing, from the evil of my sight, from the evil of my tongue, from the evil of my heart, and from the evil of my semen.",
          "ur": "یااللہ! میں آپ کی پناہ چاہتا ہوں اپنے کان کے شر سے، اوراپنی آنکھ کے شر سے، اپنی زبان کے شر سے، اپنے دل کے شر سے اور اپنی جنسی خواہش کے شر سے۔"
        },
        "reference": "Sunan Abi Dawud"
      },
      {
        "index": 15,
        "arabic": "اللَّهُمَّ احْفَظْنِي بِالْإِسْلَامِ قَائِمًا، وَاحْفَظْنِي بِالْإِسْلَامِ قَاعِدًا، وَاحْفَظْنِي بِالْإِسْلَامِ رَاقِدًا، وَلَا تُشْمِتْ بِي عَدُوًّا حَاسِدًا، وَاللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ، وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَدِكَ.",
        "translations": {
          "en": "O Allah, protect me with Islam while standing, protect me with Islam while sitting, protect me with Islam while lying down, and do not let an enemy or envious one gloat over me. O Allah, I ask You for every good that is in Your treasuries, and I seek refuge in You from every evil that is in Your treasuries.",
          "ur": "یااللہ! ہر حال میں میری اسلام کے ذریعے حفاظت فرما، کھڑا ہوں کہ بیٹھا، (جاگا ہوں یا) سویا، اور دشمن اور حسد کرنے والے کومجھ پر ہنسنے کا موقع نہ دے۔ اور اے اللہ میں تجھ سے تیرے خزانے کے ہر خیر کا طالب ہوں اور تیرے خزانے کے ہر شر سے تیری پناہ چاہتا ہوں۔"
        },
        "reference": "Al-Mustadrak"
      }
    ],
    "monday": [
      {
        "index": 1,
        "arabic": "اللهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي، اللهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
        "translations": {
          "en": "O Allah, forgive my error, my ignorance, and my excessiveness in my affairs, and what You know better than I. O Allah, forgive my joking and my seriousness, my error and my intentional sins, and all of that is with me. O Allah, forgive what I have sent forth and what I have left behind, what I have concealed and what I have made public, and what You know better than I. You are the Advancer and You are the Delayer, and You have power over all things.",
          "ur": "اے اللہ! معاف کردیجئے میری غلطی کو، میری نادانی کو۔ میں نے اپنے اوپر ظلم کیا ہے، آپ معاف فرما دیجیے۔ اور میرے ان گناہوں کو بھی بخش دیجیے جن کو آپ مجھ سے زیادہ جانتے ہیں۔ یا اللہ! بخش دیجیے میرے ان گناہوں کو بھی جو ہنسی مذاق میں مجھ سے ہوئے ہوں اورمیرے ان گناہوں کو بھی معاف فرما دیجیے جو میں نے سوچ سمجھ کر سنجیدگی سے کیے ہوں۔ میرے مالک! میری وہ خطائیں بھی معاف فرما دیجیے جو بلا ارادہ مجھ سے سرزد ہو گئی ہوں اور وہ بھی معاف کردیجیے جو میں نے جان بوجھ کر کی ہوں، اور اے اللہ! آپ جانتے ہیں کہ ) ایسی ہر طرح کی خطائیں مجھ سے ہوئی ہیں۔ اے اللہ! میرے اگلے پچھلے اور کھُلے چھُپے تمام گناہوں کو معاف کردیجیے۔ اے اللہ! تو ہی اول، توہی آخر اور تو ہی ہرچیز پر قادر ہے۔"
        },
        "reference": "Sahih Al-Bukhari"
      },
      {
        "index": 2,
        "arabic": "اللَّهُمَّ اجْعَلْنَا مِنْ عِبَادِكَ الْمُنْتَخَبِينَ، الْغُرِّ الْمُحَجَّلِينَ، الْوَفْدِ الْمُتَقَبَّلِينَ.",
        "translations": {
          "en": "O Allah, make us among Your chosen servants, the radiant, the marked, the accepted delegation.",
          "ur": "اے اللہ! مجھ کو اپنے ا ُن منتخب بندوں اور اس مقبول جماعت میں شامل فرما (قیامت کے دن)جن کی پیشانی اور ہاتھ پاؤں چمک رہے ہوں گے۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 3,
        "arabic": "اللَّهُمَّ أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي.",
        "translations": {
          "en": "O Allah, You have made my creation good, so make my character good.",
          "ur": "اے اللہ! تو نے میری صورت اچھی بنائی ہے میری سیرت و اخلاق بھی اچھے بنادے۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 4,
        "arabic": "اللهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُورِ كُلِّهَا، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا، وَعَذَابِ الْآخِرَةِ.",
        "translations": {
          "en": "O Allah, make good the outcome of all our affairs, and save us from the disgrace of this world and the punishment of the Hereafter.",
          "ur": "اے اللہ! ہمارے تمام کاموں کا انجام اچھا فرمائیے اور دنیا کی رسوائی اور آخرت کے عذاب سے ہماری حفاظت فرمائیے۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 5,
        "arabic": "اللهُمَّ إِنِّي أَسْأَلُكَ التَّوْفِيقَ لِمَحَابِّكَ مِنَ الْأَعْمَالِ، وَصَدْقَ التَّوَكُّلِ عَلَيْكَ وَحَسَنَ الظَّنِّ بِكَ.",
        "translations": {
          "en": "O Allah, I ask You for success in doing what You love, for sincere trust in You, and for having good thoughts of You.",
          "ur": "اے اللہ! مجھ کو اپنے محبوب اعمال کی، اپنی ذات عالی پر سچے توکل کی اور نیک گمان رکھنے کی توفیق دیجیے۔"
        },
        "reference": "Hilyat"
      },
      {
        "index": 6,
        "arabic": "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دُعَاءٍ لَا يُسْمَعُ.",
        "translations": {
          "en": "O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not fear, from a soul that is not satisfied, and from a supplication that is not heard.",
          "ur": "اے اللہ! میں تیری پناہ چاہتا ہوں ایسے علم سے جو نفع نہ دے، اور ایسے دل سے جو آپ سے نہ ڈرے، اور ایسے جی سے جو (کبھی)نہ بھرے، اور ایسی دعا سے جو سنی نہ جائے۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 7,
        "arabic": "اللَّهُمَّ إِنَّا نَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ، وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ، وَالْفَوْزَ بِالْجَنَّةِ، وَالنَّجَاةَ مِنَ النَّار.",
        "translations": {
          "en": "O Allah, we ask You for that which causes Your mercy, the certain means of Your forgiveness, safety from every sin, gain from every good deed, success in Paradise, and deliverance from Hell.",
          "ur": "اے اللہ! ہم تجھ سے سوال کرتے ہیں ان اعمال واخلاق اور ان احوال کاجو تیری رحمت کے موجب ہوں اور تیری مغفرت اور بخشش کا پکا ذریعہ بنیں۔ خداوندا! ہمیں ہر گناہ سے بچا اور ہر نیکی میں ہمارا حصہ رکھ۔ اے اللہ! ہم سوالی ہیں جنت پانے کے اور دوزخ سے نجات کے۔"
        },
        "reference": "Al-Mustadrak"
      },
      {
        "index": 8,
        "arabic": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ، وَقُدْرَتِكَ عَلَى الْخَلْقِ، أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى، وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ.",
        "translations": {
          "en": "O Allah, by Your knowledge of the unseen and Your power over creation, keep me alive as long as You know life is better for me, and take me when You know death is better for me. O Allah, I ask You for fear of You in private and in public, I ask You for the word of truth in times of contentment and anger, I ask You for moderation in poverty and wealth, I ask You for blessings that never end, I ask You for coolness of the eye that never ceases, I ask You for contentment after Your decree, I ask You for pleasant life after death, I ask You for the pleasure of looking upon Your face and the longing to meet You, without harmful adversity or misleading trials. O Allah, adorn us with the adornment of faith and make us guides who are guided.",
          "ur": "اے اللہ! تیرے علم غیب اور مخلوق پر تیری قدرت کا واسطہ دے کر (تجھ سے عرض کرتا ہوں کہ) مجھ کو زندہ رکھ جب تک تو میرے لیے زندگی کو بہتر جانے، اور تو جب میرے لیے موت کو بہتر جانے تو مجھ کو موت دے دے۔ اے اللہ! میں تجھ سے سوال کرتا ہوں ظاہر وباطن میں تیری خشیت کا، اور خوشی و ناراضگی (کے وقت) میں حق بات کہنے کا، اور فقرومالداری میں میانہ روی کا۔ اور تجھ سے سوال کرتا ہوں کبھی نہ ختم ہونے والی نعمتوں کااورہمیشہ کے سکون اور آنکھوں کی ٹھنڈک کا۔ اے اللہ مجھے عطا فرما تقدیر کے فیصلے پر رضا مندی، اور موت کے بعد اچھی زندگی۔ میرے مالک! میں سوالی ہوں تیرے دیدار کی لذت اور تیری ملاقات کے شوق کا، بغیر کسی تکلیف ونقصان اور گمراہ کرنے والے فتنہ کے ۔ اے اللہ! ہم کو ایمان کے زیور سے آراستہ کردے اور ہم کو ہدایت دے اور راہ پانے والوں کا راہبر بنا۔"
        },
        "reference": "Sunan Al-Nasa'i"
      },
      {
        "index": 9,
        "arabic": "اللهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ الْأَشْيَاءِ إِلَيَّ وَاجْعَلْ خَوْفَكَ أَخْوَفَ الْأَشْيَاءِ إِلَيَّ وَاقْطَعْ عَنِّي حَاجَاتِ الدُّنْيَا بِالشَّوْقِ إِلَى لِقَائِكَ وَإِذَا أَقْرَرْتَ أَعْيُنَ أَهْلِ الدُّنْيَا مِنْ دُنْيَاهُمْ فَأَقِرَّ عَيْنِي مِنْ عِبَادَتِكَ.",
        "translations": {
          "en": "O Allah, make Your love the most beloved thing to me, and make Your fear the most fearful thing to me. Make me so desirous of meeting You that the needs of this world fall away from me. And just as You have cooled the eyes of the people of the world with their world, cool my eyes with Your worship.",
          "ur": "اے اللہً ایسا کردے کہ کائنات کی ساری چیزوں سے زیادہ مجھے تیری محبت ہو، اور ساری چیزوں سے زیادہ مجھے تیرا خوف ہو۔ اور اپنی ملاقات کا شوق مجھ پر اتنا طاری کردے کہ دنیا کی ساری حاجتوں کا احساس اس کی وجہ سے فنا ہوجائے۔ اور جہاں تو بہت سے اہل دنیا کو ان کی مرغوبات دے کر ان کی آنکھیں ٹھنڈی کرتا ہے، تو میری آنکھیں طاعت وعبادت سے ٹھنڈی کردے۔"
        },
        "reference": "Hilyat"
      },
      {
        "index": 10,
        "arabic": "اللَّهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا.",
        "translations": {
          "en": "O Allah, take an easy account of me.",
          "ur": "اے اللہ! میرا آسان حساب لیجئے۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 11,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ غِنَائِي وَغِنَى مَوْلَايَ.",
        "translations": {
          "en": "O Allah, I ask You for my sufficiency and the sufficiency of my dependents.",
          "ur": "اے اللہ! میں تجھ سے اپنے لیے اور اپنے اہل وعیال کے لیے مالی آسودگی کا سوال کرتا ہوں۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 12,
        "arabic": "يَا نُورُ السَّمَاوَاتِ وَالْأَرْضِ، يَا زَيْنَ السَّمَاوَاتِ وَالْأَرْضِ، يَا جَبَّارَ السَّمَاوَاتِ وَالْأَرْضِ، يَا عِمَادَ السَّمَاوَاتِ وَالْأَرْضِ، يَا بَدِيعَ السَّمَاوَاتِ وَالْأَرْضِ، يَا قَيُّومَ السَّمَاوَاتِ وَالْأَرْضِ، يَا ذَا الْجِلَالِ وَالْإِكْرَامِ، يَا صَرِيخَ الْمُسْتَصْرِخِينَ، وَيَا غِيَاثَ الْمُسْتَغِيثِينَ، ومُنْتَهَى الْعَابِدِينَ، الْمُفَرِّجَ عَنِ الْمَكْرُوبِينَ، الْمُرَوِّحَ عَنِ الْمَغْمُومِينَ، ومُجِيبَ دُعَاءِ الْمُضْطَرِّينَ، وكاشِفَ الْكَرْبِ، وَيَا إِلَهَ الْعَالَمِينَ، وَيَا أَرْحَمَ الرَّاحِمِينَ. منَزُول ٌبِكَ كُلُّ حَاجَةٍ.",
        "translations": {
          "en": "O Light of the heavens and the earth! O Adornment of the heavens and the earth! O Compeller of the heavens and the earth! O Pillar of the heavens and the earth! O Creator of the heavens and the earth! O Sustainer of the heavens and the earth! O Possessor of Majesty and Honor! O Responder to those who call for help! O Helper of those who seek help! O Goal of the worshippers! O Reliever of the distressed! O Comforter of the grieved! O Answerer of the supplications of the desperate! O Remover of distress! O God of all the worlds! O Most Merciful of the merciful! Every need is brought to You.",
          "ur": "اے خدا،آسمانوں اور زمین کے نور! اے آسمانوں اور زمین کو سجانے والے! اے آسمانوں اور زمین کے جبار مالک! اے آسمانوں اور زمین کوتھامنے والے! اے آسمانوں اور زمین کو پیدا کرنے والے! اے آسمانوں اور زمین کو کوقائم رکھنے والے! اے جاہ و جلال کے مالک! اے مدد چاہنے والوں کی مدد کرنے والے! اے فریادیوں کی فریاد پوری کرنے والے! اے عبادت گذاروں کے منتہی! اے پریشان حال لوگوں کی پریشانی کو دور کرنے والے! اے غمزدہ لوگوں کو خوش کرنے والے! اے بیکسوں کی دعا قبول کرنے والے! اور اے مصیبت کو دور کرنے والے! اے الٰہ العالمین! اے سب سے زیادہ رحم کرنے والے میں اپنی تمام حاجتیں لے کر تیرے در پہ حاضر ہوں۔"
        },
        "reference": "Al-Mu'jam Al-Awsat"
      },
      {
        "index": 13,
        "arabic": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي، وَعَلِّمْنِي مَا يَنْفَعُنِي، وَزِدْنِي عِلْمًا، الحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ، وَأَعُوذُ بِاللَّهِ مِنْ حَالِ أَهْلِ النَّارِ.",
        "translations": {
          "en": "O Allah, benefit me from what You have taught me, teach me what will benefit me, and increase me in knowledge. All praise is due to Allah in every situation, and I seek refuge in Allah from the state of the people of Hell.",
          "ur": "اے اللہ! جو تو نے مجھے علم دیا ہے اس سے مجھ کو نفع پہنچا۔ اور وہ علم سکھا جو میرے لیے نفع بخش ہو، اور میرے علم میں اضافہ فرما، ہر حال میں تیری حمدوثنا ہے۔ اورمیں اللہ کی پناہ چاہتا ہوں اہل دوزخ کے حال سے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 14,
        "arabic": "اللَّهُمَّ فَارِجَ الْهَمِّ، كَاشِفَ الْغَمِّ، مُجِيبَ دَعْوَةِ الْمُضْطَرِّينَ، رَحْمَانَ الدُّنْيَا وَالْآخِرَةِ وَرَحِيمَهُمَا، أَنْتَ تَرْحَمُنِي، فَارْحَمْنِي بِرَحْمَةٍ تُغْنِينِي بِهَا عَنْ رَحْمَةِ مَنْ سِوَاكَ.",
        "translations": {
          "en": "O Allah, Reliever of worry, Remover of distress, Answerer of the supplications of the desperate, Merciful of this world and the Hereafter, You will have mercy on me, so have mercy on me with a mercy that makes me independent of the mercy of anyone besides You.",
          "ur": "اے اللہ! غم سے نجات دینے والے، مصیبت کو دور کرنے والے،مجبوروں کی دعا قبول کرنے والے، دنیا اور آخرت میں رحم وکرم کرنے والے، تو ہی مجھ پر رحم کرے گا، مجھ پر ایسا رحم فرما کہ وہ تیرے سوا سب سے بے نیاز کردے۔"
        },
        "reference": "Al-Mustadrak"
      },
      {
        "index": 15,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاَقِ، وَالأَعْمَالِ وَالأَهْوَاءِ.",
        "translations": {
          "en": "O Allah, I seek refuge in You from evil morals, evil deeds, and evil desires.",
          "ur": "اے اللہ!میں تجھ سے پناہ مانگتا ہوں برے اخلاق سے، اور برے اعمال سے اور بری خواہشوں سے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      }
    ],
    "tuesday": [
      {
        "index": 1,
        "arabic": "اللَّهُمَّ إِنِّي أَسْتَغْفِرُكَ لِمَا تُبْتُ إِلَيْكَ مِنْهُ ثُمَّ عُدْتُ فِيهِ، وَأَسْتَغْفِرُكَ لِمَا أَعْطَيْتُكَ مِنْ نَفْسِي ثُمَّ لَمْ أُوفِ لَكَ بِهِ، وَأَسْتَغْفِرُكَ لِلنِّعَمِ الَّتِي أَنْعَمْتَ بِهَا عَلَيَّ فَتَقَوَّيْتُ بِهَا عَلَى مَعَاصِيكَ، وَأَسْتَغْفِرُكَ لِكُلِّ خَيْرٍ أَرَدْتُ بِهِ وَجْهَكَ فَخَالَطَنِي فِيهِ مَا لَيْسَ لَكَ، اللَّهُمَّ لَا تُخْزِنِي فَإِنَّكَ بِي عَالِمٌ، وَلَا تُعَذِّبْنِي فَإِنَّكَ عَلَيَّ قَادِرٌ.",
        "translations": {
          "en": "O Allah, I seek Your forgiveness for that from which I repented to You, then returned to it. And I seek Your forgiveness for what I promised You from myself, then did not fulfill it. And I seek Your forgiveness for the blessings You bestowed upon me, with which I gained strength to disobey You. And I seek Your forgiveness for every good deed I intended for Your sake, but mixed with it something that was not for You. O Allah, do not disgrace me, for You know me well, and do not punish me, for You have power over me.",
          "ur": "اے اللہ! میں تجھ سے معافی اور بخشش چاہتا ہوں ان گناہوں کی جن سے میں نے تیرے حضور میں توبہ کی ہو (اور شامت نفس سے) پھر پلٹ کر وہی گناہ دوبارہ کیے ہوں۔۔ اور میں تجھ سے معافی اور بخشش چاہتا ہوں اس عہد کے بارے میں جو اپنی ذات کے بارے میں تجھ سے کیا ہو اور پھر اس کو وفا نہ کیا ہو(بلکہ عہد شکنی کی ہو) ۔اور میں تجھ سے معافی اور بخشش چاہتا ہوں ان نعمتوں کے بارے میں جن سے طاقت وقوت حاصل کرکے میں نے تیری نافرمانیاں کی ہوں۔ اور تجھ سے معافی اور بخشش کا سوال کرتا ہوں ہر اس نیکی کے بارے میں جو میں نے تیری رضا جوئی کی نیت سے کرنا چاہی ہو، پھر اس میں تیرےما سوا دوسرے اغراض کی آمیزش ہوگئی ہو۔ اے میرے اللہ مجھے(دوسروں کے سامنے) رسوا نہ کرنا، بیشک تو مجھے خوب جانتا ہے، تجھ سے میرا کوئی راز ڈھکا چھپا نہیں۔ اور تو مجھے میرے گناہوں کا عذاب نہ دینا، تجھے مجھ پر ہر طرح قدرت حاصل ہے۔ (اور میں بالکل عاجز اور تیرے قبضے میں ہوں)۔"
        },
        "reference": "Al-Dailami"
      },
      {
        "index": 2,
        "arabic": "اللهُمَّ أَصْلِحْ ذَاتَ بَيْنِنَا، وَأَلِّفْ بَيْنَ قُلُوبِنَا، وَاهْدِنَا سُبُلَ السَّلَامِ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ، وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَهَرَ لَنَا وَمَا بَطَنَ، اللهُمَّ بَارِكْ لَنَا فِي أَسْمَاعِنَا وَأَبْصَارِنَا وَقُلُوبِنَا وَأَزْوَاجِنَا وَذُرِّيَّاتِنَا، وَتُبْ عَلَيْنَا؛ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ، وَاجْعَلْنَا شَاكِرِينَ لِنِعْمَتِكَ، مُثْنِينَ بِهَا قَابِلِيهَا، وَأَتِمَّهَا عَلَيْنَا.",
        "translations": {
          "en": "O Allah, reconcile between us, unite our hearts, guide us to the paths of peace, and save us from darkness to light. Keep us away from indecencies, both apparent and hidden. O Allah, bless us in our hearing, our sight, our hearts, our spouses, and our children. Accept our repentance. You are the Accepter of Repentance, the Most Merciful. Make us grateful for Your blessings, praising You for them, accepting them, and complete them for us.",
          "ur": "اے اللہ! ہمارے آپسی تعلقات بہتر فرمادیجیے، اور ہمارے دلوں میں الفت و محبت قائم فرمادیجیے، سلامتی کی راہوں کی طرف ہماری رہنمائی فرمائیے، اور ہمیں (گناہوں کی) تاریکیوں سے (ہدایت واستقامت کے) نور کی طرف لے چلیے، اور ظاہری وباطنی گندگیوں سے ہماری حفاظت فرمائیے۔ اے اللہ! ہمارے کانوں، آنکھوں، ہمارے دلوں، ہماری بیویوں اور ہماری اولاد میں برکت دے دیجیے، (ہمارے مالک وآقا!) ہماری توبہ قبول فرمائیے۔ یقینا آپ بہت ہی مہربان اور رحیم ہیں۔ اے اللہ! ہمیں اپنی نعمتوں پر شکرگذار، ان پر اپنا ثنا خواں اور قدر کے ساتھ قبول کرنے والا بنا دیجیے۔ پھرہم پر مزیدخوب نعمتیں عطا فرمائیے۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 3,
        "arabic": "اللَّهُمَّ مَا أَعْطَيْتَنِي مِمَّا أُحِبُّ فَاجْعَلْهُ قُوَّةً لِي عَلَى مَا تُحِبُّ، وَمَا زَوَيْتَ عَنِّي مِمَّا أُحِبُّ فَاجْعَلْهُ فَرَاغًا لِي فِيمَا تُحِبُّ؛ اللَّهُمَّ أَعْطِنِي مَا أُحِبُّ وَاجْعَلْهُ خَيْرًا، وَاصْرِفْ عَنِّي مَا أَكْرَهُ، وَحَبِّبْ إِلَيَّ طَاعَتَكَ، وَكَرِّهْ إِلَيَّ مَعْصِيَتَكَ.",
        "translations": {
          "en": "O Allah, whatever You have given me of what I love, make it a strength for me in what You love. And whatever You have withheld from me of what I love, make it a relief for me in what You love. O Allah, give me what I love and make it good for me, and turn away from me what I dislike, and make Your obedience beloved to me, and make Your disobedience hateful to me.",
          "ur": "اے اللہ! آپ نے میری پسندیدہ چیزوں میں سے جو کچھ مجھ کو عطا کیا ہے، اس کو اپنے پسندیدہ اعمال پر قوت وطاقت کا ذریعہ بنادیجیے۔ اور جو میری پسند وطلب کی چیزیں آپ نے مجھے نہیں دی ہیں، ان کے نہ ملنے کو میرے لیے ان اعمال کی ادائیگی کے لیے فراغت کا ذریعہ بنادیجیے جو آپ کو پسند ہیں۔ اے اللہ! میری پسندیدہ چیزیں مجھے عطا فرما کر ان کوباعث خیر بنادیجیے۔ اور مجھ سے میری ناپسندیدہ چیزوں اور حالات کو دور کردیجیے۔ اور اپنی اطاعت و فرماں برداری کو میرا محبوب مشغلہ اور اپنی نافرمانی میرے لیے قابل نفرت بنادیجیے۔"
        },
        "reference": "Al-Dailami"
      },
      {
        "index": 4,
        "arabic": "اللَّهُمَّ وَفِّقْنِي لِمَا تُحِبُّ وَتَرْضَى مِنَ الْقَوْلِ وَالْعَمَلِ، وَالنِّيَّةِ وَالْهَدْيِ، إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
        "translations": {
          "en": "O Allah, grant me success in what You love and are pleased with, in word and deed, in intention and guidance. Indeed, You have power over all things.",
          "ur": "اے اللہ! مجھے اپنے محبوب وپسندیدہ اقوال، اعمال، افعال، نیت واحوال اور طرزِ عمل کی توفیق عطا فرما۔ یقینا تو ہر چیز پر قادر ہے۔"
        },
        "reference": "Al-Du'a li'l-Tabarani"
      },
      {
        "index": 5,
        "arabic": "اللَّهُمَّ طَهِّرْ قَلْبِي مِنَ النِّفَاقِ، وَعَمَلِي مِنَ الرِّيَاءِ، وَلِسَانِي مِنَ الْكَذِبِ، وَعَيْنِي مِنَ الْخِيَانَةِ، فَإِنَّكَ تَعْلَمُ خَائِنَةَ الْأَعْيُنِ، وَمَا تُخْفِي الصُّدُور.",
        "translations": {
          "en": "O Allah, purify my heart from hypocrisy, my deeds from showing off, my tongue from lying, and my eyes from treachery. Indeed, You know the treachery of the eyes and what the hearts conceal.",
          "ur": "اے اللہ! میرے دل کو نفاق سے، میرے عمل کو ریاسے، میری زبان کو جھوٹ سے اور میری آنکھوں کو نظر کی خیانت سے پاک صاف فرمادے، تو آنکھوں کی خیانت اور سینوں کے رازوں کو خوب جانتا ہے۔"
        },
        "reference": "Al-Da'awat Al-Kabir"
      },
      {
        "index": 6,
        "arabic": "اللَّهُمَّ لَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَلَا تَنْزِعْ مِنِّي صَالِحَ مَا أَعْطَيْتَنِي.",
        "translations": {
          "en": "O Allah, do not leave me to myself even for the blink of an eye, and do not take away from me the good that You have given me.",
          "ur": "اے اللہ! مجھے پلک جھپکنے کے بقدر بھی میرے حوالے نہ کریے۔ اور مجھ کو اپنی دی ہوئی نعمتوں سے محروم نہ کیجیے۔"
        },
        "reference": "Al-Bazzar"
      },
      {
        "index": 7,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مَالٍ يَكُونُ عَلَيَّ فِتْنَةً، وَمَنْ وَلَدٍ يَكُونُ عَلَيَّ وَبَالًا، وَمَنِ امْرَأَةِ السَّوْءِ، تُقَرِّبُ الشَّيْبَ قَبْلَ الْمَشِيبِ، وَأَعُوذُ بِكَ مِنْ جَارِ سَوْءٍ، تَرْعَانِي عَيْنَاهُ، وَتَسْمَعُنِي أُذْنَاهُ، إِنْ رَأَى حَسَنَةً دَفَنَهَا، وَإِنْ رَأَى سَيِّئَةً أَذَاعَهَا.",
        "translations": {
          "en": "O Allah, I seek refuge in You from wealth that becomes a trial for me, from a child who becomes a burden for me, from an evil wife who brings old age before its time, and I seek refuge in You from an evil neighbor whose eyes watch me and whose ears hear me. If he sees something good, he conceals it, and if he sees something evil, he spreads it.",
          "ur": "اے اللہ!ایسے مال سے تیری پناہ مانگتا ہوں، جو میرے لیے فتنہ (اور گناہوں کا ذریعہ) بنے۔ اور ایسی اولاد سے بھی تیری پناہ مانگتا ہوں جو میرے لیے وبال جان بن جائے اور ایسی بری عورت سے بھی جو بڑھاپے سے پہلے مجھے بوڑھا بناڈالے۔ میرے مالک! میں ایسے برے (بد خواہ) پڑوسی سے آپ کی پناہ چاہتا ہوں، جس کی آنکھیں مجھے تاکتی رہیں اورکان میری باتوں کو سنتے رہیں، اگر کوئی نیکی دیکھے تو اس کو دبادے اور اگر برائی دیکھے تو اس کومشہور کر دے۔"
        },
        "reference": "Al-Mu'jam Al-Awsat"
      },
      {
        "index": 8,
        "arabic": "اللهم إِنَّكَ سَأَلْتَنَا مِنْ أَنْفُسِنَا مَا لَا نَمْلِكُهُ إِلَّا بِكَ، اللهم فَأَعْطِنَا مِنْهَا مَا يُرْضِيكَ عَنَّا.",
        "translations": {
          "en": "O Allah, You have asked us from ourselves what we do not possess except through You. O Allah, so give us from it what will please You about us.",
          "ur": "اے اللہ! آپ نے ہم سے ایسی چیز کا مطالبہ فرمایاہے، جس پر، ہم آپ کی اعانت وتوفیق کے بغیر، قدرت نہیں رکھتے۔پس اب آپ ہی ہمیں اپنی پسندیدہ باتوں کی توفیق عنایت فرما دیجیے۔"
        },
        "reference": "Ibn Asakir"
      },
      {
        "index": 9,
        "arabic": "اللَّهُمَّ إِنَّ قُلُوبَنَا وَجَوَارَحَنَا بِيَدِكِ، لَمْ تُمَلَّكْنَا مِنْهَا شَيْئًا، فَإِذَا فَعَلْتَ ذَلِكَ بِهِمَا فَكُنْ أَنْتَ وَلِيَّهُمَا.",
        "translations": {
          "en": "O Allah, indeed our hearts and our limbs are in Your hand. You have not given us control over them. So if You do that with them, then be their Guardian.",
          "ur": "اے اللہ! یقینا ہمارے دل اور تمام اعضاء تیرے قبضۂ قدرت میں ہیں، ہم ان میں ذرا بھی اختیار نہیں رکھتے۔ پس جب ایسا ہے تو پھر آپ ہی ہمارے دلوں اور اعضاء کی حفاظت فرمائیے۔"
        },
        "reference": "Hilyat"
      },
      {
        "index": 10,
        "arabic": "يَا وَلِيَّ الْإِسْلَامِ وَأَهْلِهِ، ثَبِّتْنِي بِهِ حَتَّى أَلْقَاكَ.",
        "translations": {
          "en": "O Guardian of Islam and its people, make me firm in it until I meet You.",
          "ur": "اے اسلام اور مسلمانوں کے مددگار! مجھے موت تک اسلام پر ثابت قدم رکھ۔"
        },
        "reference": "Al-Mu'jam Al-Awsat"
      },
      {
        "index": 11,
        "arabic": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي فِي دَارِي، وَبَارِكْ لِي فِيمَا رَزَقْتَنِي.",
        "translations": {
          "en": "O Allah, forgive my sins, expand my dwelling for me, and bless me in what You have provided for me.",
          "ur": "اے اللہ! میرے گناہ معاف فرمادے، میرے گھر میں کشادگی فرمادے اور میرے رزق میں برکت پیدا فرمادے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 12,
        "arabic": "اللَّهُمَّ اجْعَلْ سَرِيرَتِي خَيْرًا مِنْ عَلاَنِيَتِي، وَاجْعَلْ عَلاَنِيَتِي صَالِحَةً، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ صَالِحِ مَا تُؤْتِي النَّاسَ مِنَ الْمَالِ وَالأَهْلِ وَالوَلَدِ، غَيْرِ الضَّالِّ وَلاَ الْمُضِلّ.",
        "translations": {
          "en": "O Allah, make my inner self better than my outer self, and make my outer self righteous. O Allah, I ask You for the good of what You give to people of wealth, family, and children, not the misguided or those who misguide.",
          "ur": "اے اللہ! میرے باطن کو میرے ظاہری حال سے بہتر بنادیجیے اور میری ظاہری حالت بھی اچھی بنادیجیے۔ یا اللہ میں سوالی ہوں اچھے مال، اچھی بیوی اور ایسی صالح اولاد کا جو نہ گمراہ ہو اور نہ گمراہ کرنے والی ہو۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 13,
        "arabic": "اللَّهُمَّ اهْدِنِي مِنْ عِنْدِكَ، وَأَفِضْ عَلَيَّ مِنْ فَضْلِكَ، وَانْشُرْ عَلَيَّ مِنْ رَحْمَتِكَ، وَأَنْزِلْ عَلَيَّ مِنْ بَرَكَاتِكَ.",
        "translations": {
          "en": "O Allah, guide me from Yourself, shower me with Your bounty, spread Your mercy over me, and send down Your blessings upon me.",
          "ur": "اے اللہ! مجھے اپنی خاص ہدایت نصیب فرما، مجھ پر فضل وانعام کی بارش فرما، مجھ پر اپنی رحمت پھیلا دے اور اپنی برکتیں نازل فرما۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 14,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى وَالتُّقَى، وَالعَفَافَ وَالغِنَى.",
        "translations": {
          "en": "O Allah, I ask You for guidance, piety, chastity, and self-sufficiency.",
          "ur": "اے اللہ! میں آپ سے مانگتا ہوں ہدایت، تقویٰ، پاک دامنی اوردل کی بے نیازی۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 15,
        "arabic": "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الْأَسْقَامِ",
        "translations": {
          "en": "O Allah, I seek refuge in You from leprosy, madness, elephantiasis, and evil diseases.",
          "ur": "اے اللہ! میں برص، پاگل پن، کوڑھ، اور تمام بری بیماریوں سے تیری پناہ چاہتا ہوں۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 16,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الصِّحَّةَ، وَالْعِفَّةَ، وَالْأَمَانَةَ، وَحُسْنَ الْخُلُقِ، وَالرِّضَا بِالْقَدَر.",
        "translations": {
          "en": "O Allah, I ask You for health, chastity, trustworthiness, good character, and contentment with the divine decree.",
          "ur": "اے اللہ! میں آپ سے تندرستی، پاک دامنی، امانت داری، بہترین اخلاق اورآپ کی تقدیر کے فیصلے پر راضی رہنے کی توفیق مانگتا ہوں۔"
        },
        "reference": "Al-Da'awat Al-Kabir"
      }
    ],
    "wednesday": [
      {
        "index": 1,
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ.",
        "translations": {
          "en": "O Allah, You are my Lord. There is no deity worthy of worship except You. You created me and I am Your servant. I will abide by my covenant and promise to You as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favors upon me and I acknowledge my sins. So forgive me, for none can forgive sins except You.",
          "ur": "اے اللہ! آپ ہی میرے رب ہیں، آپ کے علاوہ کوئی معبود نہیں، آپ نے مجھے پیدا کیااور میں آپ ہی کا بندہ ہوں، وعدہ کرتا ہوں کہ آپ سے کیے ہوئے فرماں برداری اور بندگی کے عہدوپیمان کی، جتنا مجھ سے ہو سکے گا، پابندی کروں گا ۔ اے اللہ! میں آپ سے پناہ چاہتا ہوں اپنے اعمال کے شر اور وبال سے۔ اعتراف کرتا ہوں آپ کے احسانات کا بھی اور اپنے گناہوں کا بھی، میرے مالک! میرے گناہوں کو معاف فرما دیجیے، آپ کے علاوہ کوئی گناہوں کی بخشش کرنے والا نہیں۔"
        },
        "reference": "Sahih Al-Bukhari"
      },
      {
        "index": 2,
        "arabic": "اللّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ مَوْتِ الْفُجَاءَةِ وَمِنْ لَدْغِ الْحَيَّةِ، وَمِنَ السَّبُعِ، وَمِنَ الْحَرَقِ، وَمِنَ الْغَرَقِ، وَمِنْ أَنْ أَخِرَّ عَلَى شَيْءٍ، أَوْ يَخِرَّ عَلَيَّ شَيْءٌ، وَمِنَ الْقَتْلِ عِنْدَ فِرَارِ الزَّحْفِ.",
        "translations": {
          "en": "O Allah, I seek refuge in You from sudden death, from the bite of a snake, from wild beasts, from burning, from drowning, from falling on something, or from something falling on me, and from being killed while fleeing from battle.",
          "ur": "اے پروردگار! میں آپ کی پناہ چاہتا ہوں اچانک کی موت سے، سانپ کے ڈسنے سے، تمام درندوں سے، آگ سے جلنے، پانی میں ڈوبنے،اس سے کہ میں گر کر چوٹ کھاؤں یا کوئی بھاری چیز مجھ پر گر پڑے۔ اور اس سے بھی پناہ مانگتا ہوں کہ میں جنگ سےبھاگتا ہوا مارا جاؤں۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 3,
        "arabic": "اللّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.",
        "translations": {
          "en": "O Allah, our Lord, grant us good in this world and good in the Hereafter, and save us from the punishment of the Fire.",
          "ur": "اے اللہ ہمارے مالک اور رب! ہمیں دنیا میں خیر اور نعمتیں عطا فرمائیے، اور آخرت میں بھی خیر اور انعام عطا فرمائیے، اور ہمیں دوزخ کے عذاب سے بچالیجئے۔"
        },
        "reference": "Sahih Al-Bukhari"
      },
      {
        "index": 4,
        "arabic": "اللَّهُمَّ لَا تُخْزِنِي يَوْمَ الْقِيَامَةِ.",
        "translations": {
          "en": "O Allah, do not disgrace me on the Day of Resurrection.",
          "ur": "اے اللہ! قیامت کے دن مجھے رسوا نہ کیجئے گا۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 5,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالهَرَمِ، وَالمَغْرَمِ وَالمَأْثَمِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ وَفِتْنَةِ النَّارِ، وَفِتْنَةِ القَبْرِ وَعَذَابِ القَبْرِ، وَشَرِّ فِتْنَةِ الغِنَى، وَشَرِّ فِتْنَةِ الفَقْرِ، وَمِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ خَطَايَايَ بِمَاءِ الثَّلْجِ وَالبَرَدِ، وَنَقِّ قَلْبِي مِنَ الخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبِ.",
        "translations": {
          "en": "O Allah, I seek refuge in You from laziness and old age, from debt and sin. O Allah, I seek refuge in You from the punishment of Hell and the trial of Hell, from the trial of the grave and the punishment of the grave, from the evil of the trial of wealth, from the evil of the trial of poverty, and from the evil of the trial of the False Messiah. O Allah, wash my sins with water from snow and hail, and purify my heart from sins as a white garment is purified from filth, and distance me from my sins as You have distanced the East from the West.",
          "ur": "اے اللہ! میں آپ کی پناہ مانگتا ہوں سستی و کاہلی سے، برے بڑھاپے سے،قرض کے بوجھ سے اور گناہوں سے۔ اے میرے اللہ! آپ کی پناہ جہنم کے عذاب اور اس میں جلائے جانے سے، اور قبر کے شدید امتحان اور عذاب سے۔ اے اللہ مجھے بچائیے مالداری کے فتنوںسے بھی اور فقر و محتاجی کی آزمائش سے بھی۔ میں آپ کی پناہ مانگتا ہوں مسیح دجال کے فتنہ کے شر سے۔اے اللہ میرے گناہوں کو دھوڈالیے اُولے اور برف کے صاف شفاف پانی سے ۔ اور میرے دل کوایسے صاف کر دیجیے گناہوں کی گندگی سے جیسے سفید کپڑے کو میل کچیل سے صاف کیا جاتا ہے۔ میرے مالک مجھ سے میرے گناہوں کو اتنا دور کر دیجیے جتنا آپ نے مشرق کو مغرب سے دور کردیا ہے۔"
        },
        "reference": "Sahih Al-Bukhari"
      },
      {
        "index": 6,
        "arabic": "اللهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا.",
        "translations": {
          "en": "O Allah, grant my soul its piety and purify it, for You are the best to purify it. You are its Guardian and Master. O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not fear, from a soul that is not satisfied, and from a supplication that is not answered.",
          "ur": "اے اللہ میرے نفس کو تقویٰ عطا فرما دیجئے، اس کا تزکیہ فرمادیجیے(یعنی اس کو باطنی گندگیوں سے پاک صاف کردیجئے)، آپ نفس کا بہترین تزکیہ فرمانے والے ہیں۔ آپ ہی تو میرے نفس کے مالک وآقا ہیں۔ اے اللہ میں آپ کی پناہ چاہتا ہوں ایسے علم سے جو فائدہ نہ پہنچاتا ہو، ایسے دل سے جو آپ سے نہ ڈرتا ہو، ایسے من سے جو دنیا سے نہ بھرےاور ایسی دعا سے جو قبول نہ ہو۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 7,
        "arabic": "اللهُمَّ إِنِّي أَسْأَلُكَ بِنِعْمَتِكَ السَّابِغَةِ الَّتِي أَنْعَمْتَ عَلَيَّ، وَبَلائِكَ الَّذِي أَبْلَيْتَنِي، وَفَضْلِكَ الْعَظِيمِ الَّذِي أَفْضَلْتَ عَلَيَّ أَنْ تُدْخِلَنِي الْجَنَّةَ. اللهُمَّ أَدْخِلْنِي الْجَنَّةَ بِمَنِّكَ وَفَضْلِكَ وَرَحْمَتِكَ.",
        "translations": {
          "en": "O Allah, I ask You by Your abundant blessings that You have bestowed upon me, and by Your trial that You have tested me with, and by Your great favor that You have favored me with, that You admit me to Paradise. O Allah, admit me to Paradise by Your grace, Your favor, and Your mercy.",
          "ur": "اے اللہ! میں آپ سے سوالی ہوں، آپ کی نچھاور کی ہوئی نعمتوں کا واسطہ دیتا ہوں اور آپ کے اس فضل وانعام کا واسطہ دیتا ہوں جو آپ مجھ پر فرماتے رہے ہیں، خداوندا: اپنے خاص فضل وکرم اور اپنی رحمت سے مجھے جنت میں داخل فرما دیجیے۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 8,
        "arabic": "اللَّهُمَّ عافِني في قُدْرَتِكَ، وَأَدخِلْني في رَحْمَتِكَ، وَاقْضِ أَجَلِي في طاعَتِكَ، وَاخْتِمْ لي بِخَيْرِ عَمَلي، وَاجْعَلْ ثَوابَهُ الجَنَّةَ.",
        "translations": {
          "en": "O Allah, grant me well-being in Your power, admit me into Your mercy, let my life end in obedience to You, and let my end be with the best of my deeds, and make its reward Paradise.",
          "ur": "اے اللہ! مجھے اپنی قدرت سے عافیت عطا فرمائیے اور مجھے اپنی رحمت کے سایہ تلے لے لیجئے، اور توفیق دیجیے کہ میری زندگی تیری فرماں برداری میں کٹے اور اور میرا خاتمہ بہترین عمل پر ہو، اور اے اللہ اس کے بدلہ میں مجھے جنت عطا فرما دیجئے۔"
        },
        "reference": "Tarikh Dimashq"
      },
      {
        "index": 9,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشِّقَاقِ، وَالنِّفَاقِ، وَسُوءِ الْأَخْلَاق.",
        "translations": {
          "en": "O Allah, I seek refuge in You from discord, hypocrisy, and bad character.",
          "ur": "اے اللہ! میں جھگڑے، نفاق اور برے اخلاق سے آپ کی پناہ چاہتا ہوں۔"
        },
        "reference": "Sunan Abi Dawud"
      },
      {
        "index": 10,
        "arabic": "اللهُمَّ اجْعَلْنِي أُعَظِّمُ شُكْرَكَ، وَأُكْثِرُ ذِكْرَكَ، وَأَتْبَعُ نَصِيحَتَكَ، وَأَحْفَظُ وَصِيَّتَكَ.",
        "translations": {
          "en": "O Allah, make me greatly grateful to You, make me remember You frequently, make me follow Your advice, and make me preserve Your covenant.",
          "ur": "اے اللہ! مجھے ایسا بنا دیجیے کہ میں آپ کا بہت ہی شکر ادا کروں اور آپ کا خوب ذکر کروں اور آپ کی نصیحتوں کا اتباع کروں اور آپ کے احکام کی پابندی کروں۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 11,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا لَا يَرْتَدُّ، وَنَعِيمًا لَا يَنْفَدُ، وَمُرَافَقَةَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي أَعْلَى جَنَّةِ الخُلْدِ.",
        "translations": {
          "en": "O Allah, I ask You for faith that does not turn back, blessings that do not end, and the companionship of Muhammad (peace be upon him) in the highest gardens of eternity.",
          "ur": "اے اللہ! میں آپ سے مانگتا ہوں نہ پلٹنے والا ایمان، نہ ختم ہونے والی ہمیشہ کی نعمتیں اور محمد ﷺ کی رفاقت وصحبت ہمیشہ کی جنت کے اعلیٰ درجے میں۔"
        },
        "reference": "Sahih Ibn Hibban"
      },
      {
        "index": 12,
        "arabic": "إِلَيْكَ رَبِّي فَحَبِّبْنِي، وَفِي نَفْسِي لَكَ رَبِّي فَذَلِّلْنِي، وَفِي أَعْيُنِ النَّاسِ فَعَظِّمْنِي، وَمِنْ سَيِّئِ الأَخْلَاقِ فَجَنِّبْنِي.",
        "translations": {
          "en": "To You, my Lord, make me beloved. And in myself, my Lord, make me humble. And in the eyes of people, make me great. And keep me away from evil character.",
          "ur": "اے اللہ، میرے مالک! آپ مجھے اپنا خاص محبوب بندہ بنا لیجئے، اور میرے دل کا یہ حال کردیجیے کہ میں آپ کا ذلیل وحقیر بندہ بن کر رہوں مگر لوگوں کی نگاہوں میں مجھے بڑا بنا دیجئے، اور برے اخلاق سے میری حفاظت فرمائیے۔"
        },
        "reference": "Ibn Lal fi Makarim al-Akhlaq"
      },
      {
        "index": 13,
        "arabic": "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ.",
        "translations": {
          "en": "O Allah, I seek refuge in You from the removal of Your blessings, from the change of Your well-being, from the suddenness of Your punishment, and from all Your displeasure.",
          "ur": "اے اللہ! میں آپ کی پناہ چاہتا ہوں نعمتوں کے چھن جانے سے، اور آپ کی عافیت کے بدل جانے سے، آپ کی اچانک سزا سے اور آپ کی ہر ناراضگی سے۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 14,
        "arabic": "اللهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَعَافِنِي، وَارْزُقْنِي.",
        "translations": {
          "en": "O Allah, forgive me, have mercy on me, grant me well-being, and provide for me.",
          "ur": "اے اللہ! مجھے معاف فرمائیے، مجھ پر رحم فرمائیے، مجھے عافیت عطا فرمائیے اور مجھے اپنی نعمتوں کارزق عطا کیجئے۔"
        },
        "reference": "Sahih Muslim"
      },
      {
        "index": 15,
        "arabic": "اللهُمَّ إِنِّي أَسْأَلُكَ نَفْسًا بِكَ مُطْمَئِنَّةً، تُؤْمِنُ بِلِقَائِكَ، وَتَرْضَى بِقَضَائِكَ، وَتَقْنَعُ بِعَطَائِكَ.",
        "translations": {
          "en": "O Allah, I ask You for a soul that is content with You, that believes in meeting You, that is pleased with Your decree, and that is satisfied with Your provision.",
          "ur": "اے اللہ! میں آپ سے سوالی ہوں ایسے دل کا جس کے لیے آپ کی ذات اطمینان وسکینت کا ذریعہ ہو۔ اور جو آپ کی ملاقات پر ایمان رکھتا ہو، اور آپ کے فیصلوں پر راضی ہو۔ اور آپ کی عطا پر قناعت کرنے اور مطمئن وخوش رہتا ہو۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      }
    ],
    "thursday": [
      {
        "index": 1,
        "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ",
        "translations": {
          "en": "O Allah, I have wronged myself greatly, and none forgives sins except You. So forgive me with forgiveness from Yourself, and have mercy on me. Indeed, You are the Most Forgiving, the Most Merciful.",
          "ur": "اے اللہ! میں نے اپنے اوپربڑا ظلم کیا ہے، اور تیرے سوا کوئی میرے گناہوں کو بخشنے والا نہیں ہے۔تو خاص اپنے فضل و کرم سے میرے گناہوں کو معاف فرمادے اور مجھ پر رحم فرما۔بلا شبہہ تو بڑا ہی معاف کرنے والا اور نہایت رحم کرنے والا ہے۔"
        },
        "reference": "Sahih Al-Bukhari"
      },
      {
        "index": 2,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الصَّمَمِ وَالْبَكَمِ، وَأَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ، وَأَعُوذُ بِكَ مِنَ الْغَمِّ وَأَعُوذُ بِكَ مِنَ الْهَمِّ.",
        "translations": {
          "en": "O Allah, I seek refuge in You from deafness and muteness, and I seek refuge in You from sin and debt, and I seek refuge in You from grief, and I seek refuge in You from worry.",
          "ur": "اے اللہ! میں تیری پناہ مانگتا ہوں بہرے پن اور گونگے پن سے، اور میں تیری پناہ مانگتا ہوں گناہوں سے اور قرض کے بوجھ سے، اور میں تیری پناہ چاہتا ہوں غم و تکلیف سے، اور فکر وپریشانی سے۔"
        },
        "reference": "Musnad Al-Bazzar"
      },
      {
        "index": 3,
        "arabic": "اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مُصِيبَاتِ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلاَ تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلاَ مَبْلَغَ عِلْمِنَا، وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لاَ يَرْحَمُنَا.",
        "translations": {
          "en": "O Allah, apportion to us from fear of You that which will come between us and disobedience to You, and from obedience to You that which will bring us to Your Paradise, and from certainty that which will make the afflictions of this world easy for us. Let us enjoy our hearing, our sight, and our strength as long as You keep us alive, and make it our inheritance. Make our revenge against those who wronged us, and help us against those who are hostile to us. Do not make our affliction in our religion, and do not make this world our greatest concern or the extent of our knowledge. And do not give power over us to those who will not have mercy on us.",
          "ur": "اے اللہ! ہمیں اپنا ایسا خوف دے دیجئے جو ہم کو آپ کی نا فرمانی سے روک دے، اور اپنی اتنی اطاعت کی توفیق عطا فرمائیے جو ہمارے لیے دخول جنت کا ذریعہ بن سکے، اور ہمیں وہ ایمان ویقین نصیب فرما دیجئے جس سے دنیا کی مصیبتیں آسان ہو جائیں۔ اے اللہ! ہماری سماعت، بصارت اور قوت وطاقت آخر دم تک باقی رہے اور مجھے اس حال میں موت آئے کہ یہ چیزیں سلامت ہوں۔اور ہمارے ظالموں سے انتقام مقرر فرمادے، اور جو ہم سے دشمنی کرے اس کے خلاف ہماری مدد فرما۔ اور اے ہمارے رب! دین کو نقصان پہنچانے والی مصیبتوں سے بچا، اور ہم کو ایسا (کمزور ایمان والا) نہ بنا کہ ہماری فکر وتوجہ کا بڑا مرکز دنیا ہی ہو۔ اور اے اللہ! کسی بے رحم اور سخت دل کو ہم پر مسلّط نہ فرما۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 4,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ، وَأَسْأَلُكَ عَزِيمَةَ الرُّشْدِ، وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ، وَحُسْنَ عِبَادَتِكَ، وَأَسْأَلُكَ لِسَانًا صَادِقًا، وَقَلْبًا سَلِيمًا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ مِمَّا تَعْلَمُ إِنَّكَ أَنْتَ عَلاَّمُ الغُيُوبِ",
        "translations": {
          "en": "O Allah, I ask You for firmness in the matter, I ask You for determination in guidance, I ask You for gratitude for Your blessings, and good worship of You. I ask You for a truthful tongue and a sound heart. I seek refuge in You from the evil of what You know, and I ask You for the good of what You know. I seek Your forgiveness for what You know. Indeed, You are the Knower of the unseen.",
          "ur": "اے اللہ! میں تجھ سے مانگتا ہوں دین میں ثابت قدمی اور عقل کی پختگی، اور میں سوالی ہوں تیری نعمتوں پر شکر اور اچھی عبادت کی توفیق کا۔ اے اللہ! میں تجھ سے مانگتا ہوں سچی زبان اورپاک صاف دل، اور میں ہر برائی سے تیری پناہ مانگتا ہوں جسے تو جانتا ہے اور ہر اس خیر کی توفیق مانگتا ہوں جو تیرے علم میں ہے۔ اور میں تجھ سے ہر اس گناہ سے معافی مانگتا ہوں جو تجھے معلوم ہے۔، تو پوشیدہ باتوں کو بھی خوب جاننے والا ہے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 5,
        "arabic": "اللهُمَّ إِلَيْكَ أَشْكُو ضَعْفَ قُوَّتِي، وَقِلَّةَ حِيلَتِي، وَهَوَانِي عَلَى النَّاسِ أَرْحَمَ الرَّاحِمِينَ، أَنْتَ أَرْحَمُ الرَّاحِمِينَ، إِلَى مَنْ تَكِلُنِي، إِلَى عَدُوٍّ يَتَجَهَّمُنِي، أَمْ إِلَى قَرِيبٍ مَلَّكْتَهُ أَمْرِي، إِنْ لَمْ تَكُنْ غَضْبَانًا عَلَيَّ، فَلَا أُبَالِي، إِنَّ عَافِيَتَكَ أَوْسَعُ لِي، أَعُوذُ بِنُورِ وَجْهِكَ الَّذِي أَشْرَقَتْ لَهُ الظُّلُمَاتُ، وَصَلَحَ عَلَيْهِ أَمَرُ الدُّنْيَا وَالْآخِرَةِ أَنْ تُنْزِلَ بِي غَضَبَكَ، أَوْ تُحِلَّ عَلَيَّ سَخَطَكَ، لَكَ الْعُتْبَى حَتَّى تَرْضَى، لَا قُوَّةَ إِلَّا بِكَ.",
        "translations": {
          "en": "O Allah, to You I complain of my weakness, my lack of resources, and my lowliness before people. O Most Merciful of the merciful! To whom are You entrusting me? To a distant enemy who will attack me, or to a close friend to whom You have given control over my affair? If You are not angry with me, I do not care, but Your well-being is more spacious for me. I seek refuge in the light of Your face by which the darkness is illuminated and the affairs of this world and the Hereafter are set right, from Your anger descending upon me or Your displeasure alighting upon me. I seek Your pleasure until You are pleased. There is no power or strength except with You.",
          "ur": "اے اللہ! میں تجھ ہی سے شکوہ کرتا ہوں اپنی کمزوری اور بے بسی کا اور لوگوں کے سامنے اپنی بے حیثیتی کا۔ اے ارحم الراحمین! آپ مجھے کس کے حوالے کررہے ہیں؟ کسی ترش رو دشمن کے؟ یا کسی رشتے دار کو آپ میرا مالک بنائے دے رہے ہیں؟۔ اے اللہ! اگر آپ مجھ سے ناراض نہیں ہیں تو مجھے کچھ پروا نہیں، مگر پھر بھی آپ اگر مجھے عافیت میں رکھیں تو مجھے اس میں راحت ہو گی۔ میں آپ کے غضب اور ناراضگی سے پناہ چاہتا ہوں آپ کے چہرے کے نور کے واسطے سے جس سے تمام آسمان و زمین روشن اور ساری تاریکیاں دورہو جاتی ہیں۔ میں تیری خوشامد کرتا رہوں گا تا آنکہ تو راضی ہوجائے۔ تیرے بغیر نہ کوئی زور ہے نہ طاقت۔"
        },
        "reference": "Al-Mu'jam Al-Kabir"
      },
      {
        "index": 6,
        "arabic": "اللَّهُمَّ أَلْهِمْنِي رُشْدِي، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي.",
        "translations": {
          "en": "O Allah, inspire me with my guidance, and protect me from the evil of my soul.",
          "ur": "اے اللہ میری رشد وہدایت کی بات میرے دل میں ڈال دے اور مجھے نفس کے شروروفتن سے بچالے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 7,
        "arabic": "يَا حَيُّ يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهِ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ وَلَا إِلَى أَحَدٍ مِنَ النَّاسِ.",
        "translations": {
          "en": "O Ever-Living, O Self-Sustaining! I seek help through Your mercy. Set right all my affairs, and do not leave me to myself even for the blink of an eye, nor to anyone among the people.",
          "ur": "اے زندہ وجاوید رب اورسارے عالم کو قائم رکھنے والے مالک! میں فریاد کرتا ہوں آپ کی رحمت سے، میرے تمام حالات ومعاملات درست فرما دیجیے اور پل بھر کے لیے بھی مجھے میرے اپنے یا کسی اورکے حوالے نہ کیجیے ۔"
        },
        "reference": "Sunan Al-Tirmidhi wa Al-Mu'jam Al-Saghir"
      },
      {
        "index": 8,
        "arabic": "اللَّهُمَّ اجْعَلْنِي أَخْشَاكَ كَأَنِّي أَرَاكَ أَبَدًا حَتَّى أَلْقَاكَ، وَأَسْعِدْنِي بِتَقْوَاكَ، وَلَا تُشْقِنِي بِمَعْصِيَتِكَ، وَخِرْ لِي فِي قَضَائِكَ، وَبَارِكْ لِي فِي قَدَرِكَ حَتَّى لَا أُحِبُّ تَعْجِيلَ مَا أَخَّرْتَ، وَلَا تَأْخِيرَ مَا عَجَّلْتَ، وَاجْعَلْ غِنَايَ فِي نَفْسِي، وَأَمْتِعْنِي بِسَمْعِي وَبَصَرِي، وَاجْعَلْهُمَا الْوَارِثَ مِنِّي، وَانْصُرْنِي عَلَى مَنْ ظَلَمَنِي",
        "translations": {
          "en": "O Allah, make me fear You as if I see You, and make me happy with Your piety, and do not make me miserable with Your disobedience. Choose for me in Your decree, and bless me in Your decree, until I do not love to hasten what You have delayed, nor delay what You have hastened. Make my sufficiency in my soul, and let me enjoy my hearing and my sight, and make them my inheritance, and help me against whoever wrongs me.",
          "ur": "اے اللہ! مجھے اپنا ایسا خوف عطا فرما جیسے میں تجھ کو دیکھ رہا ہوں، اور تقویٰ کی سعادت وخوش نصیبی بخش اور گناہوں کی بد بختی سے میری حفاظت فرما۔ اور میری تقدیر بہتر وبا برکت بنا دے، پھر میرا یہ حال ہو جائے کہ جو چیز آپ نے مجھ سے دور وموخر کردی ہے میں اسے جلدی حاصل کرنانہ چاہوں، اورنہ کسی ایسے کام کو موخر کرنا چاہوں جو آپ نے جلد طے کر دیا ہے۔ اور اے میرے مالک میرے دل کو سب سے بے نیاز کردے۔"
        },
        "reference": "Al-Du'a li'l-Tabarani"
      },
      {
        "index": 9,
        "arabic": "اللَّهُمَّ اغْفِرْ لَنَا وَارْحَمْنَا، وَارْضَ عَنَّا وَتَقَبَّلْ مِنَّا وَأَدْخِلْنَا الْجَنَّةَ، وَنَجِّنَا مِنَ النَّارِ، وَأَصْلِحْ لَنَا شَأْنَنَا كُلَّهُ.",
        "translations": {
          "en": "O Allah, forgive us and have mercy on us, and be pleased with us and accept from us, and admit us to Paradise, and save us from Hell, and set right all our affairs.",
          "ur": "اے اللہ! ہمیں معاف فرما دیجئے اور ہم پر رحم وکرم فرما دیجئے اور ہم سے راضی ہوجائیے اور ہماری دعا قبول فرما لیجئے اور ہمیں جنت میں داخل فرما دیجئے اور ہمیں جہنم سے بچالیجئے اور ہمارے سارے معاملات کو درست فرمادیجئے۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 10,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ صِحَّة في إِيمَانٍ، وَإِيمَانًا فِي حُسْنِ خُلُقٍ، وَنَجَاحًا يَتْبَعُهُ فَلَاحٌ وَرَحْمَةً مِنْكَ وَعَافِيَةً وَمَغْفِرَةً مِنْكَ وَرِضْوَانًا .",
        "translations": {
          "en": "O Allah, I ask You for health in faith, faith in good character, success that is followed by prosperity, and mercy from You, well-being, forgiveness, and pleasure.",
          "ur": "اے اللہ! میں تجھ سے مانگتا ہوں صحت وتندرستی ایمان کے ساتھ، اور ایمان و یقین حسن اخلاق کے ساتھ، اور دنیا کی کامیابیوں کے بعد آخرت کی فلاح، اور اے مالک! تیری رحمت وعافیت اور تیری مغفرت ورضامندی مانگتا ہوں۔"
        },
        "reference": "Musnad Ahmad"
      },
      {
        "index": 11,
        "arabic": "يَا مُقَلِّبَ القُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ.",
        "translations": {
          "en": "O Turner of hearts, make my heart firm in Your religion.",
          "ur": "اے دلوں کو پھیرنے والے! میرے دل کو اپنے دین پر جمادیجئے۔"
        },
        "reference": "Sunan Al-Tirmidhi"
      },
      {
        "index": 12,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَالحَزَنِ، وَالعَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالبُخْلِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ.",
        "translations": {
          "en": "O Allah, I seek refuge in You from worry and grief, from incapacity and laziness, from cowardice and miserliness, from being heavily in debt, and from being overpowered by men.",
          "ur": "اے اللہ میں تیری پناہ چاہتا ہوں فکر وغم سے، بے بسی وسستی سے اور بزدلی اور بخل سے۔"
        },
        "reference": "Sahih Al-Bukhari"
      }
    ]
  }
}
